#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ИнициализацияОбработки(Параметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ЗагрузитьНастройки(Неопределено);
    ПолучитьСписокМоделей(Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура ВыполнитьАнализ(Команда)
	
	Если РеквизитыЗаполнены() = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.СсылкаНаСправочник) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаВыполнитьАнализ", "Доступность", Ложь);
		ВыполнитьАнализФоново(); 
		Если ЗначениеЗаполнено(ЭтотОбъект.УникальныйИдентификаторЗадания) Тогда
			ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 3, Истина);
		КонецЕсли;
	Иначе
		ВыполнитьАнализНаСервере();
		Элементы.ГруппаШапка.ТекущаяСтраница = Элементы.ГруппаАнализ;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСписокМоделей(Команда)
	
	Элементы.Model.СписокВыбора.Очистить();
	ЗаполнитьСписокВыбораМоделейНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СохранениеНастроек

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	
	Если ЗначениеЗаполнено(Объект.СсылкаНаСправочник) = Ложь Тогда
		ВызватьИсключение "Подключите обработку в справочник ""Дополнительные отчеты и обработки"".";
	КонецЕсли;
	
	Если РеквизитыЗаполнены() = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	мНастройка = новый Структура();
	мНастройка.Вставить("URL",	 		 Объект.URL);
	мНастройка.Вставить("Model", 		 Объект.Model);
	мНастройка.Вставить("Замер", 		 Объект.Замер);
	мНастройка.Вставить("Классификатор", Объект.Классификатор);
	мНастройка.Вставить("РазмерПакета",	 Объект.РазмерПакета);
	мНастройка.Вставить("ЗаписыватьРезультатОбработкиВКлассификатор",	 Объект.ЗаписыватьРезультатОбработкиВКлассификатор);
	мНастройка.Вставить("ЗаписыватьРезультатОбработкиВИсходныйЗамер",	 Объект.ЗаписыватьРезультатОбработкиВИсходныйЗамер);
	
	// сохраним настройки выборки из БД
	массивНастройкВыборки = новый Массив;
	Для каждого стр из Объект.ТаблицаНастроекВыборки Цикл
		массивНастройкВыборки.Добавить(новый Структура("Замер, Свойство", стр.Замер, стр.Свойство));
	КонецЦикла;
	мНастройка.Вставить("ТаблицаНастроекВыборки", массивНастройкВыборки);
	
	УправлениеХранилищемНастроекВызовСервера.ЗаписатьДанныеВБезопасноеХранилищеРасширенный(Объект.СсылкаНаСправочник, мНастройка, "Автоматическая классификация ошибок ИИ", "АвтоматическаяКлассификацияОшибокИИ");

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройки(Команда)
	
	мНастройка = УправлениеХранилищемНастроекВызовСервера.ДанныеИзБезопасногоХранилища(Объект.СсылкаНаСправочник, "АвтоматическаяКлассификацияОшибокИИ");
	Если мНастройка <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Объект, мНастройка,, "ТаблицаНастроекВыборки");
		попытка
			// сохраним настройки выборки из БД
			Объект.ТаблицаНастроекВыборки.Очистить();
			Для каждого стр из мНастройка.ТаблицаНастроекВыборки Цикл
				ЗаполнитьЗначенияСвойств(Объект.ТаблицаНастроекВыборки.Добавить(),стр);
			КонецЦикла;
		исключение
		конецпопытки;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализацияОбработки(Параметры)
	
	// Установка базовых реквизитов обработки
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	
	МетаданныеОбработки    = ТекущийОбъект.Метаданные();
	ИмяОбработки           = МетаданныеОбработки.Имя;
	СинонимОбработки       = МетаданныеОбработки.Синоним;
	
	Если Параметры.Свойство("ДополнительнаяОбработкаСсылка") Тогда
		ТекущийОбъект.СсылкаНаСправочник = Параметры.ДополнительнаяОбработкаСсылка;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущийОбъект.СсылкаНаСправочник) Тогда
		ЭтотОбъект.Элементы.ГруппаСсылкаНаСправочник.Видимость = Ложь;
		ЭтотОбъект.Элементы.СсылкаНаСправочник.Видимость       = Ложь;
	Иначе
		ЭтотОбъект.Элементы.ГруппаСсылкаНаСправочник.Видимость = Истина;
		ЭтотОбъект.Элементы.СсылкаНаСправочник.Видимость       = Истина;
		
		ЗапросДанных = Новый Запрос;
		ЗапросДанных.УстановитьПараметр("ИмяОбъекта",   ИмяОбработки);
		ЗапросДанных.УстановитьПараметр("Наименование", СинонимОбработки);
		ЗапросДанных.УстановитьПараметр("ВидОбработки", Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка);
		ЗапросДанных.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Отбор.Ссылка КАК Ссылка
		|ИЗ
		|	(ВЫБРАТЬ
		|		0 КАК Приоритет,
		|		ДополнительныеОтчетыИОбработки.Ссылка КАК Ссылка
		|	ИЗ
		|		Справочник.ДополнительныеОтчетыИОбработки КАК ДополнительныеОтчетыИОбработки
		|	ГДЕ
		|		НЕ ДополнительныеОтчетыИОбработки.ПометкаУдаления
		|		И НЕ ДополнительныеОтчетыИОбработки.ЭтоГруппа
		|		И ДополнительныеОтчетыИОбработки.Вид = &ВидОбработки
		|		И ДополнительныеОтчетыИОбработки.ИмяОбъекта = &ИмяОбъекта
		|		И ДополнительныеОтчетыИОбработки.Публикация = ЗНАЧЕНИЕ(Перечисление.ВариантыПубликацииДополнительныхОтчетовИОбработок.Используется)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		1,
		|		ДополнительныеОтчетыИОбработки.Ссылка
		|	ИЗ
		|		Справочник.ДополнительныеОтчетыИОбработки КАК ДополнительныеОтчетыИОбработки
		|	ГДЕ
		|		НЕ ДополнительныеОтчетыИОбработки.ПометкаУдаления
		|		И НЕ ДополнительныеОтчетыИОбработки.ЭтоГруппа
		|		И ДополнительныеОтчетыИОбработки.Вид = &ВидОбработки
		|		И ДополнительныеОтчетыИОбработки.Наименование = &Наименование
		|		И ДополнительныеОтчетыИОбработки.Публикация = ЗНАЧЕНИЕ(Перечисление.ВариантыПубликацииДополнительныхОтчетовИОбработок.Используется)) КАК Отбор
		|
		|УПОРЯДОЧИТЬ ПО
		|	Отбор.Приоритет";
		
		ВыборкаДанных = ЗапросДанных.Выполнить().Выбрать();
		Если ВыборкаДанных.Следующий() Тогда
			ТекущийОбъект.СсылкаНаСправочник = ВыборкаДанных.Ссылка;
		КонецЕсли;
	КонецЕсли;

	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Функция РеквизитыЗаполнены()
	
	Отказ = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Объект.Замер) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан замер!",,"Замер", "Объект.Замер", Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Классификатор) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан классификатор ошибок!",,"Классификатор", "Объект.Классификатор", Отказ);
	КонецЕсли;
	
	Если Объект.ТаблицаНастроекВыборки.Количество()=0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указаны настройки выборки!",,"ТаблицаНастроекВыборки", "Объект.ТаблицаНастроекВыборки", Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.URL) или НЕ ЗначениеЗаполнено(Объект.Model) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указаны настройки подключения!",,"ГруппаНастройкиПодключения",, Отказ);
	КонецЕсли;
	
	Возврат Не Отказ;
	
КонецФункции

&НаСервере
Процедура ВыполнитьАнализНаСервере()
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");	
	ТекущийОбъект.ВыполнитьАнализ();
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораМоделейНаСервере()
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");	
	ТаблицаМоделей = ТекущийОбъект.ПолучитьТаблицуМоделей();
	
	Для каждого стр из ТаблицаМоделей Цикл
		ПредставлениеМодели = СтрШаблон("%1 (обновл. %2, %3 МБ)",
			стр.name, Формат(стр.modified_at, "ДЛФ=D"), Формат(стр.size / 1048576, "ЧДЦ=2"));
		Элементы.Model.СписокВыбора.Добавить(стр.name, ПредставлениеМодели);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьАнализФоново()

	АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);
	АдресХранилищаРезультата = ПоместитьВоВременноеХранилище(Неопределено, ЭтотОбъект.УникальныйИдентификатор);
	
	ПараметрыКоманды = Новый Структура;
	ПараметрыКоманды.Вставить("ДополнительнаяОбработкаСсылка", Объект.СсылкаНаСправочник);
	ПараметрыКоманды.Вставить("ИдентификаторКоманды", "АвтоматическаяКлассификацияОшибокИИ");
	ПараметрыКоманды.Вставить("АдресХранилищаРезультата", АдресХранилищаРезультата);
	
	ПараметрыФЗ = Новый Массив;
	ПараметрыФЗ.Добавить(ПараметрыКоманды);
	ПараметрыФЗ.Добавить(АдресРезультата);
	
	ФЗ = ФоновыеЗадания.Выполнить("ДополнительныеОтчетыИОбработки.ВыполнитьКоманду", ПараметрыФЗ, ЭтотОбъект.УникальныйИдентификатор, "Автоматическая классификация ошибок ИИ");
	
	Если ФЗ <> Неопределено Тогда
		ЭтотОбъект.УникальныйИдентификаторЗадания = ФЗ.УникальныйИдентификатор;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	РезультатПроверкиДлительныхОпераций = ОперацияВыполнена(ЭтотОбъект.УникальныйИдентификаторЗадания);
	
	Если РезультатПроверкиДлительныхОпераций.Статус = "Выполнено" Тогда
		
		ПолучитьРезультатИзХранилища();
		
		ЭтотОбъект.УникальныйИдентификаторЗадания = Неопределено;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаВыполнитьАнализ", "Доступность", Истина);
		Элементы.ГруппаШапка.ТекущаяСтраница = Элементы.ГруппаАнализ;

	ИначеЕсли РезультатПроверкиДлительныхОпераций.Статус = "Ошибка" Тогда
		
		Если РезультатПроверкиДлительныхОпераций.ИнформацияОбОшибке <> Неопределено
			и РезультатПроверкиДлительныхОпераций.ИнформацияОбОшибке.Причина <> Неопределено
			и РезультатПроверкиДлительныхОпераций.ИнформацияОбОшибке.Причина.Свойство("Описание") Тогда
			ТекстОшибки = СтрШаблон("Фоновое задание завершено с ошибкой по причине %1", РезультатПроверкиДлительныхОпераций.ИнформацияОбОшибке.Причина.Описание);
		Иначе
			ТекстОшибки = "Фоновое задание завершено с ошибкой.";
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		
		ЭтотОбъект.УникальныйИдентификаторЗадания = Неопределено;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаВыполнитьАнализ", "Доступность", Истина);
		
	ИначеЕсли РезультатПроверкиДлительныхОпераций.Статус = "Выполняется" Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОперацияВыполнена(УникальныйИдентификаторЗадания)
	
	Результат = Новый Структура;
	Результат.Вставить("Статус", "Выполняется");
	Результат.Вставить("ИнформацияОбОшибке", Неопределено);
	
	ФЗ = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(УникальныйИдентификаторЗадания);
	Если ФЗ <> Неопределено Тогда
		Если ФЗ.Состояние = СостояниеФоновогоЗадания.Завершено Тогда
			Результат.Статус = "Выполнено";
		ИначеЕсли ФЗ.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно или ФЗ.Состояние = СостояниеФоновогоЗадания.Отменено Тогда
			Результат.Статус = "Ошибка";
			Результат.ИнформацияОбОшибке = ФЗ.ИнформацияОбОшибке;
		КонецЕсли; 
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПолучитьРезультатИзХранилища()
	
	СтруктураВозврата = ПолучитьИзВременногоХранилища(ЭтотОбъект.АдресРезультата);
	Если СтруктураВозврата <> Неопределено и СтруктураВозврата.Свойство("АдресХранилищаРезультата") Тогда
		СтруктураРезультат = ПолучитьИзВременногоХранилища(ЭтотОбъект.АдресХранилищаРезультата);
		Если СтруктураРезультат.Свойство("ТаблицаАнализа") Тогда
			Объект.ТаблицаАнализа.Загрузить(СтруктураРезультат.ТаблицаАнализа);
			Объект.ТаблицаАнализа.Сортировать("ДатаСобытия");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
