#ЕСЛИ Сервер ИЛИ ВнешнееСоединение ТОГДА

#Область СведенияОВнешнейОбработке

Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("1.2.1.4");
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	ПараметрыРегистрации.Наименование = ЭтотОбъект.Метаданные().Синоним;
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	ЗаполнитьЗначенияСвойств(ПараметрыРегистрации, ПолучитьСтруктуруОписанияОбработки());
	
	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Идентификатор = "АвтоматическаяКлассификацияОшибокИИ";
	Команда.Представление = ЭтотОбъект.Метаданные().Синоним;
	Команда.Использование = "ВызовСерверногоМетода";
	
	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Идентификатор = "АвтоматическаяКлассификацияОшибокИИНастройка";
	Команда.Представление = НСтр("ru = 'Автоматическая классификация ошибок ИИ (настройка)'");
	Команда.Использование = "ОткрытиеФормы";
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Функция ПолучитьСтруктуруОписанияОбработки()
	
	СтруктураОписанияОбработки = Новый Структура;
	
	СтруктураОписанияОбработки.Вставить("Версия", "2026.07.23");
	СтруктураОписанияОбработки.Вставить("Информация",
		"История изменений: 
		|2026.07.15 Создана обработка.");
	
	Возврат СтруктураОписанияОбработки;
	
КонецФункции

#КонецОбласти

Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыКоманды) Экспорт
	
	Если Врег(ИдентификаторКоманды) = Врег("АвтоматическаяКлассификацияОшибокИИ") Тогда
		
		Если ПараметрыКоманды.Свойство("ДополнительнаяОбработкаСсылка") и ЗначениеЗаполнено(ПараметрыКоманды.ДополнительнаяОбработкаСсылка) Тогда
			
			//прочитаем настройки
			мНастройка = УправлениеХранилищемНастроекВызовСервера.ДанныеИзБезопасногоХранилища(ПараметрыКоманды.ДополнительнаяОбработкаСсылка, "АвтоматическаяКлассификацияОшибокИИ");
			Если мНастройка <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(ЭтотОбъект, мНастройка,, "ТаблицаНастроекВыборки");
				попытка
					// сохраним настройки выборки из БД
					ТаблицаНастроекВыборки.Очистить();
					Для каждого стр из мНастройка.ТаблицаНастроекВыборки Цикл
						ЗаполнитьЗначенияСвойств(ТаблицаНастроекВыборки.Добавить(),стр);
					КонецЦикла;
				исключение
				конецпопытки;
			КонецЕсли;
			
			ВыполнитьАнализ(ПараметрыКоманды);
		Иначе
			ЗаписатьСобытиеЖР("Не заполнена ссылка на обработку.",, УровеньЖурналаРегистрации.Ошибка);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьТаблицуМоделей() Экспорт
	
	ТаблицаМоделей = Новый ТаблицаЗначений;
	ТаблицаМоделей.Колонки.Добавить("name", Новый ОписаниеТипов("Строка"));
	ТаблицаМоделей.Колонки.Добавить("size", Новый ОписаниеТипов("Число"));
	ТаблицаМоделей.Колонки.Добавить("modified_at", Новый ОписаниеТипов("Дата"));
	
	//URL = "http://srv-msk-1c-llm:11434/api/generate";
	СтруктураАдрес = ОбщегоНазначенияКлиентСервер.СтруктураURI(URL);
	
	HTTPСоединение = Новый HTTPСоединение(СтруктураАдрес.Хост, СтруктураАдрес.Порт, , , , 60, ВРег(СтруктураАдрес.Схема) = "HTTPS");
	HTTPЗапрос = Новый HTTPЗапрос("/api/tags");
	
	HTTPОтвет = HTTPСоединение.ВызватьHTTPМетод("GET", HTTPЗапрос);
	ТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
	
	СоответствиеОтвета = JSONВЗначение(ТелоОтвета);
	
	Ответ = СоответствиеОтвета.Получить("models");
	Если Ответ <> Неопределено и ТипЗнч(Ответ) = Тип("Массив") Тогда
		Для каждого Соотв из Ответ Цикл
			НовСтрока = ТаблицаМоделей.Добавить();
			НовСтрока.name = Соотв.Получить("name");
			НовСтрока.size = Соотв.Получить("size");
			modified_at = Соотв.Получить("modified_at");
			Если modified_at <> Неопределено Тогда
				НовСтрока.modified_at = ПрочитатьДатуJSON(modified_at, ФорматДатыJSON.ISO);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ТаблицаМоделей.Сортировать("size Убыв, modified_at Убыв");
	
	Возврат ТаблицаМоделей;
	
КонецФункции

Процедура ВыполнитьАнализ(ПараметрыКоманды = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(URL) или Не ЗначениеЗаполнено(Model)
		или Не ЗначениеЗаполнено(Замер) или Не ЗначениеЗаполнено(Классификатор) Тогда
		ЗаписатьСобытиеЖР("Не заполнены настройки для анализа",, УровеньЖурналаРегистрации.Предупреждение);
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаОкончания) Тогда
		ДатаОкончания = НачалоДня(ТекущаяДатаСеанса());
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ДатаНачала) Тогда
		ДатаНачала = НачалоДня(ДатаОкончания-1);
	КонецЕсли;
	
	ЗаполнитьТаблицуДляАнализа();
	Если ТаблицаАнализа.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаКлассификатор = СформироватьТаблицуКлассификатор(); 
	
	ДиалогСOllama(ТаблицаАнализа, ТаблицаКлассификатор);
	
	Если ЗаписыватьРезультатОбработкиВКлассификатор = Истина 
		или ЗаписыватьРезультатОбработкиВИсходныйЗамер = Истина Тогда
		
		Для каждого стр из ТаблицаАнализа Цикл
			Если ЗначениеЗаполнено(стр.Кластер) Тогда
				Если ЗаписыватьРезультатОбработкиВКлассификатор = Истина Тогда
					ЗаписатьРезультатРегистрКлассификации(стр, стр.Кластер);
				КонецЕсли;
				Если ЗаписыватьРезультатОбработкиВИсходныйЗамер = Истина Тогда
					ЗаписатьРезультатИсходныйЗамер(стр, стр.Кластер);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	//фоновое задание
	Если ПараметрыКоманды <> Неопределено и ПараметрыКоманды.Свойство("АдресХранилищаРезультата") Тогда
		СтруктураРезультат = Новый Структура;
		СтруктураРезультат.Вставить("ТаблицаАнализа", ТаблицаАнализа.Выгрузить());										
		ПараметрыКоманды.Вставить("РезультатВыполнения", Новый Структура("АдресХранилищаРезультата", ПоместитьВоВременноеХранилище(СтруктураРезультат, ПараметрыКоманды.АдресХранилищаРезультата)));
	КонецЕсли;
	
КонецПроцедуры

Процедура ДиалогСOllama(ТаблицаАнализа, ТаблицаКлассификатор)
	
	//Адрес API Ollama
	//URL = "http://srv-msk-1c-llm:11434/api/chat";
	СтруктураАдрес = ОбщегоНазначенияКлиентСервер.СтруктураURI(URL);
	
	ОбучающийПромт = СформироватьПромт(ТаблицаКлассификатор);

	Сообщения = Новый Массив;
	
	СообщениеСистемы = Новый Структура;
	СообщениеСистемы.Вставить("role", "system");
	СообщениеСистемы.Вставить("content", ОбучающийПромт);
	Сообщения.Добавить(СообщениеСистемы);
	
	Для каждого стр из ТаблицаАнализа Цикл
		
		// Добавляем вопрос в историю
		СообщениеПользователя = Новый Структура;
		СообщениеПользователя.Вставить("role", "user");
		СообщениеПользователя.Вставить("content", стр.Текст);
		Сообщения.Добавить(СообщениеПользователя);
		
		Ответ = ОтправитьЗапросOllama(СтруктураАдрес, Сообщения);
		
		Если Ответ = Неопределено Тогда
			ЗаписатьСобытиеЖР("Не удалось получить ответ. Проверьте, запущен ли Ollama",, УровеньЖурналаРегистрации.Ошибка);
			Прервать;
		КонецЕсли;
		
		// Добавляем ответ ассистента в историю для сохранения контекста
		СообщениеАссистента = Новый Структура;
		СообщениеАссистента.Вставить("role", "assistant");
		СообщениеАссистента.Вставить("content", Ответ);
		Сообщения.Добавить(СообщениеАссистента);
		
		НайденныйКластер = ТаблицаКлассификатор.Найти(Ответ, "GUID");
		Если НайденныйКластер <> Неопределено Тогда
			стр.Кластер = НайденныйКластер.Ссылка;
		Иначе
			ТекстСообщения = СтрШаблон("Не смог преобразовать ответ %1", Строка(Ответ));
			ЗаписатьСобытиеЖР(ТекстСообщения,, УровеньЖурналаРегистрации.Информация)
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ОтправитьЗапросOllama(СтруктураАдрес, Сообщения, Температура = 0.7, МаксТокенов = 2000)
	
	Ответ = Неопределено;
	
	JSONЗапрос = Новый Структура;
	JSONЗапрос.Вставить("model", Model);
	JSONЗапрос.Вставить("messages", Сообщения);
	JSONЗапрос.Вставить("stream", Ложь);
	JSONЗапрос.Вставить("temperature", Температура);
	JSONЗапрос.Вставить("max_tokens", МаксТокенов);
	
	СтрокаJSON = ЗначениеВJSON(JSONЗапрос);
	
	HTTPСоединение = Новый HTTPСоединение(СтруктураАдрес.Хост,СтруктураАдрес.Порт,,,,60,ВРег(СтруктураАдрес.Схема)="HTTPS");
	HTTPЗапрос = Новый HTTPЗапрос("/api/chat");
	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8);
	
	HTTPОтвет = HTTPСоединение.ВызватьHTTPМетод("POST", HTTPЗапрос);
	
	Если HTTPОтвет.КодСостояния <> 200 Тогда
		ЗаписатьСобытиеЖР(СтрШаблон("Ошибка API: %1", HTTPОтвет.КодСостояния),, УровеньЖурналаРегистрации.Ошибка);
		Возврат Ответ;
	КонецЕсли;
	
	ТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
	
	Результат = JSONВЗначение(ТелоОтвета);
	
	message = Результат.Получить("message");
	Если message <> Неопределено Тогда
		content = message.Получить("content");	
		Если content <> Неопределено Тогда
			Ответ = content;
		КонецЕсли;
	Иначе
		ЗаписатьСобытиеЖР("В ответе нет свойства message",, УровеньЖурналаРегистрации.Предупреждение)
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция СформироватьТаблицуКлассификатор() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Классификатор", Классификатор);
	Запрос.Текст = ПолучитьТекстЗапросаКлассификатора();
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	
	ТаблицаРезультат.Колонки.Добавить("GUID", Новый ОписаниеТипов("Строка"));
	Для каждого стр из ТаблицаРезультат Цикл
		стр.GUID = Строка(стр.Ссылка.УникальныйИдентификатор());
	КонецЦикла;
               
	Возврат ТаблицаРезультат; 

КонецФункции

Функция СформироватьПромт(ТаблицаКлассификатор) Экспорт
	
	РезультатНачало = "Помоги мне классифицировать ошибки. Я буду присылать тебе текст ошибки,
	|а ты отвечай мне одним словом." + Символы.ПС;
	
	РезультатФрагмент = "";
	ШаблонТекста = "Если в тексте есть слова:
	|%1 
	|тогда твой ответ будет %2";
	
	Для каждого стр из ТаблицаКлассификатор Цикл
		Если СокрЛП(стр.Текст) = "" Тогда
			Продолжить;
		КонецЕсли;
		РезультатФрагмент = РезультатФрагмент + СтрШаблон(ШаблонТекста, СокрЛП(стр.Текст), Строка(стр.GUID)) + Символы.ПС;
	КонецЦикла;
	
	Возврат РезультатНачало + РезультатФрагмент + "Начинаем?";
	
КонецФункции

Функция ПолучитьТекстЗапросаКлассификатора()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ИзвестныеСитуации.Ссылка КАК Ссылка,
	|	ИзвестныеСитуации.Родитель КАК Родитель,
	|	ИзвестныеСитуации.Наименование КАК Наименование,
	|	ИзвестныеСитуации.Текст КАК Текст,
	|	ИзвестныеСитуации.НижняяГраница КАК НижняяГраница
	|ИЗ
	|	Справочник.ИзвестныеСитуации КАК ИзвестныеСитуации
	|ГДЕ
	|	ИзвестныеСитуации.Ссылка В ИЕРАРХИИ(&Классификатор)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка ИЕРАРХИЯ";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ЗаполнитьТаблицуДляАнализа()
	
	ТаблицаАнализа.Очистить();
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Свойствоdecision",	СправочникиСерверПовтИсп.ПолучитьСвойствоПоИмениСинониму("decision","decision"));
	Запрос.УстановитьПараметр("ДатаНачала",			ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",		ДатаОкончания);
	Запрос.Текст = ПолучитьТекстЗапросаВыборкиОшибок();
	
	Если РазмерПакета=0 Тогда		
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ПЕРВЫЕ 200","");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"200",формат(РазмерПакета,"ЧГ="));
	КонецЕсли;
	
	Для каждого настройка из ТаблицаНастроекВыборки Цикл
		Запрос.УстановитьПараметр("Замер", настройка.Замер);
		Запрос.УстановитьПараметр("Свойство", настройка.Свойство);
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Запрос.Выполнить().Выгрузить(), ТаблицаАнализа);
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьТекстЗапросаВыборкиОшибок()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	КС.Ссылка КАК СобытиеЗамера
	|ПОМЕСТИТЬ вт_ОбработанныеСобытия
	|ИЗ
	|	Справочник.СобытияЗамера.КлючевыеСвойства КАК КС
	|ГДЕ
	|	КС.Ссылка.Владелец = &Замер
	|	И КС.Свойство = &Свойствоdecision
	|	И (ВЫРАЗИТЬ(КС.Значение КАК СТРОКА(100))) <> """"
	|	И КС.Ссылка.ДатаСобытия МЕЖДУ &ДатаНачала И &ДатаОкончания
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	КлассификаторДанных.СобытиеЗамера
	|ИЗ
	|	РегистрСведений.КлассификаторДанных КАК КлассификаторДанных
	|ГДЕ
	|	КлассификаторДанных.Ключ = &Замер
	|	И КлассификаторДанных.Свойство = &Свойство
	|	И КлассификаторДанных.ДатаСобытия МЕЖДУ &ДатаНачала И &ДатаОкончания
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СобытиеЗамера
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 200
	|	&Замер КАК Замер,
	|	КС.Ссылка КАК СобытиеЗамера,
	|	КС.Свойство КАК Свойство,
	|	КС.Значение КАК Текст,
	|	КС.Ссылка.ДатаСобытия КАК ДатаСобытия,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(КС.Ссылка) КАК GUID,
	|	"""" КАК Ошибка
	|ИЗ
	|	Справочник.СобытияЗамера.КлючевыеСвойства КАК КС
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ОбработанныеСобытия КАК вт_ОбработанныеСобытия
	|		ПО КС.Ссылка = вт_ОбработанныеСобытия.СобытиеЗамера
	|ГДЕ
	|	КС.Ссылка.Владелец = &Замер
	|	И КС.Свойство = &Свойство
	|	И НЕ КС.Свойство.ЧисловойРежим
	|	И (ВЫРАЗИТЬ(КС.Значение КАК СТРОКА(100))) <> """"
	|	И КС.Ссылка.ДатаСобытия МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И вт_ОбработанныеСобытия.СобытиеЗамера ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаСобытия";	
	
	Возврат ТекстЗапроса;

КонецФункции

Процедура ЗаписатьРезультатРегистрКлассификации(Знач стр, Знач КлассОсновной)
	
	Перем МенеджерЗаписи;
	
	МенеджерЗаписи = РегистрыСведений.КлассификаторДанных.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Ключ = Замер;
	МенеджерЗаписи.Основной = Истина;
	МенеджерЗаписи.ДатаСобытия = стр.ДатаСобытия;
	МенеджерЗаписи.СобытиеЗамера =  стр.СобытиеЗамера;
	МенеджерЗаписи.Свойство = стр.Свойство;
	МенеджерЗаписи.Кластер = КлассОсновной;
	МенеджерЗаписи.Косинус = 1;
	МенеджерЗаписи.Записать();

КонецПроцедуры

Процедура ЗаписатьРезультатИсходныйЗамер(Знач стр, Знач КлассОсновной)
	
	СобытиеЗамераОбъект = стр.СобытиеЗамера.ПолучитьОбъект();
	
	Свойство = СправочникиСерверПовтИсп.ПолучитьСвойствоПоИмениСинониму("decision","decision");
	мОтбор = Новый Структура("Свойство",Свойство);
	н_строки = СобытиеЗамераОбъект.КлючевыеСвойства.НайтиСтроки(мОтбор);
	
	Если н_строки.Количество()>0 Тогда
		стр_н = н_строки[0];
	Иначе
		стр_н = СобытиеЗамераОбъект.КлючевыеСвойства.Добавить();
	КонецЕсли;
	
	стр_н.Свойство = Свойство;
	стр_н.Значение = КлассОсновной;
	стр_н.ЗначениеЧисло = 1;
	
	СобытиеЗамераОбъект.ОбменДанными.Загрузка=Истина;
	СобытиеЗамераОбъект.Записать();

КонецПроцедуры

Функция ЗначениеВJSON(Знач Значение)
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Значение);
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

Функция JSONВЗначение(Знач Строка, Знач ИменаСвойствСоЗначениямиДата = Неопределено, Знач ПрочитатьВСоответствие = Истина)
	
	Если ТипЗнч(ИменаСвойствСоЗначениямиДата) = Тип("Строка") Тогда
		ИменаСвойствСоЗначениямиДата = СтрРазделить(ИменаСвойствСоЗначениямиДата, ", " + Символы.ПС, Ложь);
	КонецЕсли;
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Строка);
	
	Возврат ПрочитатьJSON(ЧтениеJSON, ПрочитатьВСоответствие, ИменаСвойствСоЗначениямиДата);
	
КонецФункции

Процедура ЗаписатьСобытиеЖР(Комментарий, локОбъект=Неопределено, УровеньСобытия=Неопределено, НаименованиеСобытия="") Экспорт
	
	ПолноеИмяСобытия	=	"Дополнительные отчеты и обработки." + ЭтотОбъект.Метаданные().Синоним;
	
	локУровеньСобытия	=	УровеньСобытия;
	Если УровеньСобытия=Неопределено Тогда
		локУровеньСобытия		=	УровеньЖурналаРегистрации.Информация;
	ИначеЕсли ТипЗнч(УровеньСобытия)=Тип("Строка") Тогда
		Если УровеньСобытия="Ошибка" Тогда
			локУровеньСобытия		=	УровеньЖурналаРегистрации.Ошибка;
		КонецЕсли; 
	КонецЕсли; 
	
	Если локОбъект=Неопределено Тогда
		ОбъектМетаданных	=	Неопределено;
		Данные				=	Неопределено;
	Иначе
		ОбъектМетаданных	=	локОбъект.Метаданные();
		Данные				=	локОбъект.Ссылка;
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации(ПолноеИмяСобытия, локУровеньСобытия,ОбъектМетаданных,Данные,Комментарий);
	
КонецПроцедуры

#КОНЕЦЕСЛИ