
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		УчетнаяЗапись = "Бот Лариса (почта)";
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Тема) Тогда
		Тема = "Проблемы производительности оборудования";
	КонецЕсли;
	Элементы.АутентификацияSMTP.СписокВыбора.Добавить("Login");
	Элементы.АутентификацияSMTP.СписокВыбора.Добавить("ПоУмолчанию");
	Элементы.АутентификацияSMTP.СписокВыбора.Добавить("БезАутентификации");
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	мНастройка = новый Структура();
	мНастройка.Вставить("АдресСервераSMTP",АдресСервераSMTP);
	мНастройка.Вставить("ПользовательSMTP",ПользовательSMTP);
	мНастройка.Вставить("Пользователь",Пользователь);
	мНастройка.Вставить("ПортSMTP",ПортSMTP);
	мНастройка.Вставить("АутентификацияSMTP",АутентификацияSMTP);
	мНастройка.Вставить("ПарольSMTP",ПарольSMTP);
	мНастройка.Вставить("Пароль",Пароль);
	мНастройка.Вставить("Тема",Тема);
	мНастройка.Вставить("Получатели",Получатели);
	мНастройка.Вставить("ИмяОтправителя",ИмяОтправителя);
	мНастройка.Вставить("Отправитель",Отправитель);
	мНастройка.Вставить("ИспользоватьSSLSMTP",ИспользоватьSSLSMTP);
	
	УправлениеХранилищемНастроекВызовСервера.ЗаписатьДанныеВБезопасноеХранилищеРасширенный(УчетнаяЗапись,мНастройка,"Настройка отправки сообщений по электронной почте");
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройки(Команда)
	мНастройка = УправлениеХранилищемНастроекВызовСервера.ДанныеИзБезопасногоХранилища(УчетнаяЗапись);
	Если мНастройка<>Неопределено Тогда
		АдресСервераSMTP 	= мНастройка.АдресСервераSMTP;
		Пользователь 		= мНастройка.Пользователь;
		Пароль 				= мНастройка.Пароль;
		ПользовательSMTP 	= мНастройка.ПользовательSMTP;
		ПарольSMTP 			= мНастройка.ПарольSMTP;
		Тема				= мНастройка.Тема;
		ПортSMTP			= мНастройка.ПортSMTP;
		АутентификацияSMTP	= мНастройка.АутентификацияSMTP;
		Получатели			= мНастройка.Получатели;
		ИмяОтправителя		= мНастройка.ИмяОтправителя;
		Отправитель			= мНастройка.Отправитель;
		ИспользоватьSSLSMTP = мНастройка.ИспользоватьSSLSMTP;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщение(Команда)
	Сообщить("Убедитесь, что вы сохранили настройки прежде тестирования отправки сообщений!");
	ОтправитьСообщениеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтправитьСообщениеНаСервере()
	
	мОъект = РеквизитФормыВЗначение("Объект");	
	мОъект.ОтправитьСообщение(УчетнаяЗапись, Неопределено, ТекстСообщения);
	Сообщить("Команда выполнена успешно! Возможные ошибки смотрите в журнале регистрации!");
КонецПроцедуры
