Функция ВыполнитьОбработку() Экспорт
	Рез = "";
	
	Попытка
		// если уже установлен необходимый интерфейс
		// установим интерфейс
		НКП = новый НастройкиКлиентскогоПриложения;
		
		// Вариант расположения интерфейса
		НКП.ВариантМасштабаФормКлиентскогоПриложения=ВариантМасштабаФормКлиентскогоПриложения.Компактный;
		НКП.ВариантИнтерфейсаКлиентскогоПриложения=ВариантИнтерфейсаКлиентскогоПриложения.Такси;
		
		ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиКлиентскогоПриложения",,НКП);		
		
		Рез = "OK";
	Исключение
		Рез = ОписаниеОшибки();
	КонецПопытки;
	
	Возврат Рез;
КонецФункции

//Процедура ЗаполнитьПараметрыИзФайла() Экспорт
//	ИмяФайлаПараметров = ИспользуемоеИмяФайла+".config";
//	Ф = Новый Файл(ИмяФайлаПараметров);
//	Если Ф.Существует() Тогда
//		Попытка
//			Т = Новый ТекстовыйДокумент;
//			Т.Прочитать(ИмяФайлаПараметров);
//			Для Ш=1 по Т.КоличествоСтрок() Цикл
//				ТекущаяСтрока = СокрЛП(Т.ПолучитьСтроку(Ш));
//				//обрезать комментарий
//				ПозицияКомментария = Найти(ТекущаяСтрока,";");
//				Если ПозицияКомментария>0 Тогда
//					ТекущаяСтрока = Лев(ТекущаяСтрока, ПозицияКомментария-1);
//				КонецЕсли;
//				ПозицияРазделителя = Найти(ТекущаяСтрока,"=");
//				Если ПозицияРазделителя>0 Тогда
//					ИмяПараметра = Лев(ТекущаяСтрока,ПозицияРазделителя-1);
//					ЗначениеПараметра = Сред(ТекущаяСтрока,ПозицияРазделителя+1);
//					Попытка
//						Выполнить(ИмяПараметра + " = " + ЗначениеПараметра + ";");
//					Исключение
//					КонецПопытки;
//				КонецЕсли;
//			КонецЦикла;
//		Исключение
//		КонецПопытки;
//	КонецЕсли;
//КонецПроцедуры
