

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РежимРабочегоСтола = Истина;
	Если Параметры.Отбор.Свойство("Владелец") Тогда
		ОтборЗамер = Параметры.Отбор.Владелец;
		РежимРабочегоСтола = Ложь;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОтборЗамер", "ТолькоПросмотр", Истина);
	Иначе
		Настройки = ВосстановитьНастройкиОтборов();
		ОтборЗамер = Настройки.ОтборЗамер;
		ОтборДлительность = Настройки.ОтборДлительность;
	КонецЕсли;
	УстановитьОтборВладелец(ЭтаФорма);
	УстановитьОтборДлительность(ЭтаФорма);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборВладелец(Форма)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Форма.Список, "Владелец", Форма.ОтборЗамер, , , ЗначениеЗаполнено(Форма.ОтборЗамер), , );
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборДлительность(Форма)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Форма.Список, "ДлительностьМкс", Форма.ОтборДлительность * 1000000, ВидСравненияКомпоновкиДанных.БольшеИлиРавно, , ЗначениеЗаполнено(Форма.ОтборДлительность), , );
КонецПроцедуры

&НаКлиенте
Процедура ОтборДлительностьПриИзменении(Элемент)
	УстановитьОтборДлительность(ЭтаФорма);
	СохранитьНастройкиОтборовКлиент();
КонецПроцедуры


&НаКлиенте
Процедура ОтборЗамерПриИзменении(Элемент)
	УстановитьОтборВладелец(ЭтаФорма);
	СохранитьНастройкиОтборовКлиент();
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройкиОтборовКлиент()
	Если РежимРабочегоСтола = Истина Тогда
		СохранитьНастройкиОтборов(ПолучитьНастройкиКлиент());
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьНастройкиКлиент()
	Настройки = Новый Структура;
	Настройки.Вставить("ОтборЗамер", ОтборЗамер);
	Настройки.Вставить("ОтборДлительность", ОтборДлительность);
	Возврат Настройки;	
КонецФункции

&НаСервереБезКонтекста
Функция ВосстановитьНастройкиОтборов()
	Настройки = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("СобытияЗамераФормаСписка", "НастройкиОтбора");
	НастройкиРезультат = Новый Структура("ОтборЗамер, ОтборДлительность");
	Если ТипЗнч(Настройки)=Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(НастройкиРезультат, Настройки);
	КонецЕсли;
	Возврат НастройкиРезультат;
КонецФункции 

&НаСервереБезКонтекста
Процедура СохранитьНастройкиОтборов(Настройки)
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("СобытияЗамераФормаСписка", "НастройкиОтбора", Настройки);
КонецПроцедуры
