
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		УчетнаяЗапись = "Бот Оракул";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	мНастройка = новый Структура();
	мНастройка.Вставить("IDЧата",IDЧата);
	мНастройка.Вставить("Пароль",Пароль);
	мНастройка.Вставить("АдресПрокси",АдресПрокси);
	мНастройка.Вставить("ПортПрокси",ПортПрокси);
	мНастройка.Вставить("Токен",Токен);
	мНастройка.Вставить("ИспользоватьПрокси",ИспользоватьПрокси);
	УправлениеХранилищемНастроекВызовСервера.ЗаписатьДанныеВБезопасноеХранилищеРасширенный(УчетнаяЗапись,мНастройка,"Настройка отправки сообщений по Telegram");
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройки(Команда)
	мНастройка = УправлениеХранилищемНастроекВызовСервера.ДанныеИзБезопасногоХранилища(УчетнаяЗапись);
	Если мНастройка<>Неопределено Тогда
		IDЧата 		= мНастройка.IDЧата;
		Пароль 		= мНастройка.Пароль;
		Токен 		= мНастройка.Токен;
		ПортПрокси 	= мНастройка.ПортПрокси;
		АдресПрокси = мНастройка.АдресПрокси;
		ИспользоватьПрокси = мНастройка.ИспользоватьПрокси;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщение(Команда)
	ОтправитьСообщениеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтправитьСообщениеНаСервере()
	
	мОъект = РеквизитФормыВЗначение("Объект");	
	мНастройки = новый Структура();
	мНастройки.Вставить("IDЧата",IDЧата);
	мНастройки.Вставить("Токен",Токен);
	мНастройки.Вставить("АдресПрокси",АдресПрокси);
	мНастройки.Вставить("ПортПрокси",ПортПрокси);
	мНастройки.Вставить("ИспользоватьПрокси",ИспользоватьПрокси);
	
	мОъект.ОтправитьСообщениеTelegram(мНастройки, ТекстСообщения);
	Сообщить("Команда выполнена успешно! Возможные ошибки смотрите в журнале регистрации!");
КонецПроцедуры
