#Область ЧтениеВСправочникЖурнала

Функция РазобратьФайлВСправочник(Замер, ИмяФайлаДляРазбора) Экспорт
		
	//инициализация фильтров
	РеквизитыЗамера = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Замер, "ФильтрТипСобытия,ФильтрСвойстваСобытия,ФильтрСвойстваСобытияКроме,ФильтрДлительность");
	РеквизитыЗамера.Вставить("ФильтрТипСобытия", РеквизитыЗамера.ФильтрТипСобытия.Получить());
	ЕстьФильтрТипСобытия = РеквизитыЗамера.ФильтрТипСобытия<>Неопределено И РеквизитыЗамера.ФильтрТипСобытия.Количество()>0;
	ЕстьФильтрСвойстваСобытия = ЗначениеЗаполнено(РеквизитыЗамера.ФильтрСвойстваСобытия);
	ЕстьФильтрДлительность = ЗначениеЗаполнено(РеквизитыЗамера.ФильтрДлительность); 
	
	ФайлЗамера = Справочники.ФайлыЗамера.ПолучитьФайлПоПолномуИмени(Замер, ИмяФайлаДляРазбора);
	
	//еще раз проверим прочитан полностью
	СостояниеЧтения = РегистрыСведений.СостояниеЧтения.ПолучитьСостояние(ФайлЗамера);
	Если СостояниеЧтения.ЧтениеЗавершено Тогда
		Возврат 0;
	КонецЕсли;		
	
	//пропуск пустых файлов
	ФайлТЖ = Новый Файл(ИмяФайлаДляРазбора);
	//ФС фикс 10.06.2020 проверка наличия файла
	Если НЕ ФайлТЖ.Существует() Тогда
		РегистрыСведений.СостояниеЧтения.УстановитьСостояниеОшибки(ФайлЗамера, "Файл не найден");
		Возврат 0;
	КонецЕсли;
	
	РазмерФайла = ФайлТЖ.Размер();
	Если РазмерФайла <=3 Тогда
		Возврат 0;
	КонецЕсли;
			
	ПериодФайла = ОбновлениеДанныхРегламентное.ПолучитьПериодПоИмениФайла(ФайлТЖ.ИмяБезРасширения);
	Процесс = ОбновлениеДанныхРегламентное.ПолучитьПроцессПоИмениФайла(ИмяФайлаДляРазбора);
	
	ДатаНачалаЧтения = ТекущаяДата();
	ДатаПрочитанныхДанных = Неопределено;
	
	Текст = Новый ЧтениеТекста(ИмяФайлаДляРазбора, КодировкаТекста.UTF8, Символы.ВК + Символы.ПС, "", Ложь);
	
	ОбновлениеДанных.ПозиционироватьЧтениеНаСтрокуФайла(Текст, СостояниеЧтения.ПрочитаноСтрок);

	//продолжаем чтение с позиции СостояниеЧтения.ПрочитаноСтрок
	ПрочитаноСтрок = СостояниеЧтения.ПрочитаноСтрок;
	СтрокаТекста = Текст.ПрочитатьСтроку();
	Если СтрокаТекста = Неопределено Тогда
		
		//может быть прочитано строк не поменялось а полностью поменялось 
		РегистрыСведений.СостояниеЧтения.УстановитьСостояние(
			ФайлЗамера, 
			ПериодФайла,
			ПрочитаноСтрок, 
			ДатаНачалаЧтения, 
			РазмерФайла);		
		Возврат 0;
	КонецЕсли;
	ПрочитаноСтрок = ПрочитаноСтрок + 1;
	
	
	//регэксп объекты
	АнализаторОтборПоСвойствам = ОбновлениеДанных.АнализаторСоздать(РеквизитыЗамера.ФильтрСвойстваСобытия);
	
	//часть реквизитов будет одинакова для всего файла
	СтруктураЗаписи = ОбновлениеДанных.ПолучитьСтруктуруЗаписиСправочник();
	СтруктураЗаписи.Владелец = Замер;
	СтруктураЗаписи.Файл = ФайлЗамера;
	СтруктураЗаписи.ТипПроцесса = Процесс;
	
	Пока СтрокаТекста <> Неопределено Цикл
		
		Чтение = Новый ЧтениеJSON;
		Чтение.УстановитьСтроку(СтрокаТекста);
		ДанныеСобытия= ПрочитатьJSON(Чтение, Истина);
		
		СледующаяСтрока = Текст.ПрочитатьСтроку();
		Если СледующаяСтрока<>Неопределено Тогда
			ПрочитаноСтрок = ПрочитаноСтрок + 1;
		КонецЕсли;
		
		ДатаJSON = ДанныеСобытия.Получить("ts");
		ДатаСобытия = ПрочитатьДатуJSON(ДатаJSON,ФорматДатыJSON.ISO);
		Минуты = Минута(ДатаСобытия);
		Секунды = Секунда(ДатаСобытия);
		ДолиСекунды = Сред(ДатаJSON, СтрНайти(ДатаJSON,".")+1, СтрДлина(ДатаJSON));
		Длительность = ДанныеСобытия.Получить("duration");
		ИмяСобытия = ДанныеСобытия.Получить("name");
		УровеньСобытия = 0;
		
		//фильтр длительность
		Если ЕстьФильтрДлительность 
			И Длительность < РеквизитыЗамера.ФильтрДлительность Тогда
			СтрокаТекста = СледующаяСтрока;
			Продолжить;
		КонецЕсли;
		
		//фильтр тип события
		ТипСобытия = СправочникиСерверПовтИсп.ПолучитьСобытие(ИмяСобытия);
		Если ЕстьФильтрТипСобытия 
			И РеквизитыЗамера.ФильтрТипСобытия.НайтиПоЗначению(ТипСобытия)=Неопределено Тогда
			СтрокаТекста = СледующаяСтрока;
			Продолжить;
		КонецЕсли;
		
		//фильтр свойства события. пропуск если совпадает и "кроме", и если не совпадает и не "кроме"
		Если ЕстьФильтрСвойстваСобытия 
			И ОбновлениеДанных.АнализаторПроверить(АнализаторОтборПоСвойствам, ИмяСобытия) = РеквизитыЗамера.ФильтрСвойстваСобытияКроме Тогда
			СтрокаТекста = СледующаяСтрока;
			Продолжить;
		КонецЕсли;
		
		СтруктураЗаписи.НомерСтрокиФайла = ПрочитаноСтрок;
		СтруктураЗаписи.ТипСобытия = ТипСобытия;
		СтруктураЗаписи.ДатаСобытия = ПериодФайла + Секунды + (Минуты * 60);
		СтруктураЗаписи.ДатаСобытияМкс = Число(ДолиСекунды);
		СтруктураЗаписи.УровеньСобытия = Число(УровеньСобытия);
		СтруктураЗаписи.ДлительностьМкс = Число(Длительность);
		СтруктураЗаписи.КлючевыеСвойства.Очистить();
		ДатаПрочитанныхДанных = СтруктураЗаписи.ДатаСобытия;
		
		Для каждого Сч из ДанныеСобытия Цикл
			ИмяСвойства = Сч.Ключ;
			Свойство = СправочникиСерверПовтИсп.ПолучитьСвойство(ИмяСвойства);
			Если НЕ ЗначениеЗаполнено(Свойство) Тогда
				Продолжить;
			КонецЕсли; 
			
			Если СтруктураЗаписи.КлючевыеСвойства.Получить(Свойство) = Неопределено Тогда 
				ЗначениеСвойства = Сч.Значение;
				
				Отказ = Ложь;	
				ОбновлениеДанных.ВыполнитьНормализациюЗначенияСвойства(СтруктураЗаписи, Свойство, ЗначениеСвойства, Отказ);
				Если Отказ = Ложь Тогда
					СтруктураЗаписи.КлючевыеСвойства.Вставить(Свойство, ЗначениеСвойства);
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		СтруктураЗаписи.ВсеСвойства = СтрокаТекста; //сохраним в оригинале
		
		Справочники.СобытияЗамера.ЗаписатьСобытиеЧисло(СтруктураЗаписи);
		
		СтрокаТекста = СледующаяСтрока;
				
	КонецЦикла;
	
	Текст.Закрыть();
	
	// Обновление инфорации о количестве прочитанных строк
	РегистрыСведений.СостояниеЧтения.УстановитьСостояние(
		ФайлЗамера, 
		ПериодФайла,
		ПрочитаноСтрок, 
		ДатаНачалаЧтения,
		РазмерФайла,
		ДатаПрочитанныхДанных);

	Возврат 0;
	
КонецФункции	
	
#КонецОбласти