&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПриИзменении(Элемент)
	Объект.ХешЗначения = ПолучитьХешЗначения(Объект.Текст);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьХешЗначения(Строка)
	хеширование = Новый ХешированиеДанных(ХешФункция.SHA1);
	хеширование.Добавить(Строка);
	Возврат Base64Строка(хеширование.ХешСумма);	
КонецФункции

&НаКлиенте
Процедура СобытияПоСитуации(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Свойство", Объект.Свойство);
	ПараметрыФормы.Вставить("ХешЗначения", Объект.ХешЗначения);
	ОткрытьФорму("Справочник.ИзвестныеСитуации.Форма.СобытияПоСитуации", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры


&НаКлиенте
Процедура ВариантыЗначенийПриИзменении(Элемент)
	УстановитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЭлементов()
	
	Элементы.СтраницаВариантыЗначений.Видимость = Объект.ВариантыЗначений;
	Элементы.СтраницаОдиночноеЗначение.Видимость = НЕ Объект.ВариантыЗначений;
	
КонецПроцедуры

