
&НаКлиенте
Процедура ЗначениеПриИзменении(Элемент)
	Объект.ХешЗначения = ПолучитьХешЗначения(Объект.Значение);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьХешЗначения(Строка)
	хеширование = Новый ХешированиеДанных(ХешФункция.SHA1);
	хеширование.Добавить(Строка);
	Возврат Base64Строка(хеширование.ХешСумма);	
КонецФункции

&НаКлиенте
Процедура СобытияПоСитуации(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Свойство", Объект.Свойство);
	ПараметрыФормы.Вставить("ХешЗначения", Объект.ХешЗначения);
	ОткрытьФорму("Справочник.ИзвестныеСитуации.Форма.СобытияПоСитуации", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры

