Функция ПолучитьФайлПоПолномуИмени(ЗНАЧ Замер, ЗНАЧ ПолноеИмяФайла) Экспорт
	ПолноеИмяМассив = СтрРазделить(ПолноеИмяФайла, "\");
	ПоследняяЧасть = ПолноеИмяМассив[ПолноеИмяМассив.ВГраница()-1] + "\" + ПолноеИмяМассив[ПолноеИмяМассив.ВГраница()];
	ИмяБезРасширения = Лев(ПолноеИмяМассив[ПолноеИмяМассив.ВГраница()],8);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ФайлыЗамера.Ссылка
	|ИЗ
	|	Справочник.ФайлыЗамера КАК ФайлыЗамера
	|ГДЕ
	|	ФайлыЗамера.Владелец = &Замер
	|	И ФайлыЗамера.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Наименование", ПоследняяЧасть);
	Запрос.УстановитьПараметр("Замер", Замер);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ФайлОбъект = Справочники.ФайлыЗамера.СоздатьЭлемент();
		ФайлОбъект.Наименование = ПоследняяЧасть;
		ФайлОбъект.Владелец = Замер;
		ФайлОбъект.ДатаФайла = ОбновлениеДанныхРегламентное.ПолучитьПериодПоИмениФайла(ИмяБезРасширения);
		ФайлОбъект.Записать();
		Результат = ФайлОбъект.Ссылка;
	Иначе
		Результат = РезультатЗапроса.Выгрузить()[0].Ссылка;
	КонецЕсли;
	Возврат Результат;
КонецФункции