&НаКлиенте
Перем СтарыеКолонки;
&НаКлиенте
Перем СписокИнформационныхБаз;
&НаКлиенте
Перем СписокПроцессов;
&НаКлиенте
Перем СоответсвиеСинонимовСвойств;


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СоответсвиеСинонимовСвойств = ПолучитьСоответсвиеСинонимовСвойств();
	ЗагрузитьНастройки(Неопределено);
	Если НЕ ЗначениеЗаполнено(Список) Тогда
		Список="session list";
	КонецЕсли;
	Элементы.Список.СписокВыбора.Добавить("infobase list","инф. базы");
	Элементы.Список.СписокВыбора.Добавить("server list","сервера");
	Элементы.Список.СписокВыбора.Добавить("process list","процессы");
	Элементы.Список.СписокВыбора.Добавить("connection list","соединения");
	Элементы.Список.СписокВыбора.Добавить("session list","сеансы");
КонецПроцедуры




&НаКлиенте
Процедура ЗамерПриИзменении(Элемент)
	ЗагрузитьНастройки(Неопределено);
КонецПроцедуры

&НаСервере
Функция ПолучитьСоответсвиеСинонимовСвойств()
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	возврат РеквизитОбъект.ПолучитьСоответсвиеСинонимовСвойств()
КонецФункции

&НаКлиенте
Процедура ЗагрузитьНастройки(Команда)
	Попытка
		мНастройка = УправлениеХранилищемНастроекВызовСервера.ДанныеИзБезопасногоХранилища(Замер);
		Если мНастройка<>Неопределено Тогда
			КодировкаТекстаФайла = мНастройка.КодировкаТекстаФайла;
			ПутьКИсполняемомуФайлуRAC = мНастройка.ПутьКИсполняемомуФайлуRAC;
	
			Корзина.Очистить();
			Для каждого стр из мНастройка.Корзина Цикл
				стр_н = Корзина.Добавить();
				ЗаполнитьЗначенияСвойств(стр_н,стр);
			КонецЦикла;
			
			ТаблицаКластеров.Очистить();
			Для каждого стр из мНастройка.Кластеры Цикл
				стр_н = ТаблицаКластеров.Добавить();
				ЗаполнитьЗначенияСвойств(стр_н,стр);
				стр_н.key = стр_н.server+"("+стр_н.port_ras+") -> "+стр_н.name;
			КонецЦикла;
	
		КонецЕсли;
	Исключение
		Сообщить("Не верные настройки. Выберете данные!");
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСписокСеансов(Команда)
	ПолучтьСписокНаКлиенте("session");
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКластеровВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	ПолучтьСписокНаКлиенте(СокрЛП(СтрЗаменить(Список,"list","")));
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКластеровВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПолучтьСписокНаКлиенте(СокрЛП(СтрЗаменить(Список,"list","")));
КонецПроцедуры

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	ПолучтьСписокНаКлиенте(СокрЛП(СтрЗаменить(Список,"list","")));
КонецПроцедуры



&НаКлиенте
Процедура ПолучитьДанные(Команда)
	ПолучтьСписокНаКлиенте(СокрЛП(СтрЗаменить(Список,"list","")));
КонецПроцедуры

&НаКлиенте
Процедура ПолучтьСписокНаКлиенте(list,licenses=Ложь)
	ТекущиеДанные = Элементы.ТаблицаКластеров.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СтарыеКолонки=Неопределено Тогда
		СтарыеКолонки = новый Массив;
	КонецЕсли;	
	
	мПараметры = СформироватьСтруктуруЗапроса(ТекущиеДанные);

	СтруктураДанныхОтвета = ПолучитьСписок(мПараметры,list,licenses);
	
	СписокИнформационныхБаз = СтруктураДанныхОтвета.МассивСоответствиеДанных;
	
	ДлительностьЗапроса = СтруктураДанныхОтвета.Длительность;
	
	//ДобавитьПредставлениеInfobase(СтруктураДанныхОтвета.МассивСоответствиеДанных);
	
	СоздатьИОбновитьКолонки(СтруктураДанныхОтвета.МассивСоответствиеДанных);
	
	ВычислитьФункцииАгрегации(СтруктураДанныхОтвета.МассивСоответствиеДанных,list);
	
КонецПроцедуры


&НаСервере
Функция ПолучитьСписок(мПараметры,list,licenses=Ложь)
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	возврат РеквизитОбъект.ПолучитьСписок(мПараметры,list,licenses)
КонецФункции

&НаКлиенте
Функция СформироватьСтруктуруЗапроса(Знач ТекущиеДанные)
	
	мПараметры = новый Структура();
	мПараметры.Вставить("ПутьКИсполняемомуФайлуRAC",ПутьКИсполняемомуФайлуRAC);
	мПараметры.Вставить("КодировкаТекстаФайла",КодировкаТекстаФайла);
	Если НЕ ТекущиеДанные=Неопределено Тогда
		мПараметры.Вставить("server",ТекущиеДанные.server);
		мПараметры.Вставить("port_ras",ТекущиеДанные.port_ras);
		мПараметры.Вставить("cluster",ТекущиеДанные.cluster);
		мПараметры.Вставить("cluster_user",ТекущиеДанные.cluster_user);
		мПараметры.Вставить("cluster_pwd",ТекущиеДанные.cluster_pwd);
		cluster = ТекущиеДанные.cluster;
	Иначе
		мПараметры.Вставить("server","");
		мПараметры.Вставить("port_ras",1545);
		мПараметры.Вставить("cluster","");
		мПараметры.Вставить("cluster_user","");
		мПараметры.Вставить("cluster_pwd","");
		cluster = "";
	КонецЕсли;
	
	Возврат мПараметры;

КонецФункции

&НаСервере
Процедура ВычислитьФункцииАгрегации(Знач МассивСоответствиеДанных,Знач list)
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	
	// очистили
	ТаблицаАгрегацииДанных.Очистить();	
	
	МассивСтруктурАгрегацииДанных = РеквизитОбъект.ВычислитьФункцииАгрегации(МассивСоответствиеДанных, Корзина, list);
	
	Для каждого стр из МассивСтруктурАгрегацииДанных Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаАгрегацииДанных.Добавить(),стр);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьИОбновитьКолонки(Знач МассивСоответствиеДанных)
	
	Перем ИмяКолонки, Колонки, КС, КЧ, МассивТипов, ОписаниеТипов, ОписаниеЧисло, стр, стр_н, ш, элем;
	
	Колонки = новый Массив;
	МассивТипов = новый Массив;
	МассивТипов.Добавить(Тип("Строка"));
	МассивТипов.Добавить(Тип("Число"));
	МассивТипов.Добавить(Тип("Булево"));
	МассивТипов.Добавить(Тип("Дата"));
	КС = Новый КвалификаторыСтроки(200);
	КЧ = Новый КвалификаторыЧисла(20,3);
	ОписаниеТипов = Новый ОписаниеТипов(МассивТипов, , ,КЧ, КС);
	ОписаниеЧисло = Новый ОписаниеТипов("Число", , ,КЧ);	
	
	Колонки = новый массив;
	
	Для каждого элем из МассивСоответствиеДанных Цикл	
		
		ш=0;
		Для каждого стр из элем Цикл
			ИмяКолонки = "колонка_"+XMLСтрока(ш);
			Заголовок = стр.Ключ;
			Синоним = СоответсвиеСинонимовСвойств.Получить(Заголовок);
			Если НЕ Синоним=Неопределено Тогда
				Заголовок = Синоним;
			КонецЕсли;
			Колонки.Добавить(новый Структура("Имя,Ключ,ТипСтрокой,ТипЗначения,Ширина,Заголовок,ИмяКолонки,ИмяСледующегоЭлемента,ТолькоПросмотр",ИмяКолонки,стр.Ключ,Строка(ТипЗнч(стр.Значение)),ОписаниеТипов,10,Заголовок,ИмяКолонки,Неопределено,Истина));
			ш=ш+1;
		КонецЦикла;
		прервать;
		
	КонецЦикла;
	
	// создадим динамически таблицу 
	Попытка
		СоздатьДинамическиеКолонкиТаблицы("ТаблицаДанных",Колонки,СтарыеКолонки);
	Исключение
	КонецПопытки;
	
	
	СтарыеКолонки = Колонки;	
	
	ТаблицаДанных.Очистить();
	
	Для каждого элем из МассивСоответствиеДанных Цикл
		стр_н = ТаблицаДанных.Добавить();
		ш=0;
		Для каждого стр из элем Цикл
			ИмяКолонки = "колонка_"+XMLСтрока(ш);
			стр_н[ИмяКолонки]=стр.Значение;
			ш=ш+1;
		КонецЦикла;	
	КонецЦикла;

	//Элементы.Декорация1.Видимость = ТаблицаДанных.Количество()=0;
	
КонецПроцедуры


// Процедура - Создать динамические колонки таблицы
//
// Параметры:
//  ИмяТаблицы					 - строка	 - имя таблицы на форме строкой
//  МассивСтруктурКолонок		 - 	 - описание создаваемых колонок
//  МассивСтруктурТекущихКолонок - 	 - описание текущих колонок для удаления из текущей таблицы
&НаСервере
Процедура СоздатьДинамическиеКолонкиТаблицы(ИмяТаблицы,МассивСтруктурКолонок,МассивСтруктурТекущихКолонок,КромеИменКолонок="")
	
	МассивУдаляемыхЭлементов = новый Массив;
	МассивДобавляемыхЭлементов = новый Массив;
	
	Для каждого Колонка из МассивСтруктурТекущихКолонок Цикл
		Если Найти(КромеИменКолонок,Колонка.Имя) Тогда
			Продолжить;
		КонецЕсли;
		МассивУдаляемыхЭлементов.Добавить(ИмяТаблицы+"."+Колонка.Имя);
		Элементы.Удалить(Элементы[ИмяТаблицы+Колонка.Имя]);    
	КонецЦикла;   
	
	МассивТипов = новый Массив;
	МассивТипов.Добавить(Тип("ТаблицаЗначений"));           
	ОписаниеТиповТаблица = Новый ОписаниеТипов(МассивТипов);
	МассивТипов = новый Массив;
	МассивТипов.Добавить(Тип("Строка"));          
	ОписаниеТиповСтрока = Новый ОписаниеТипов(МассивТипов);
	
	Для каждого Колонка из МассивСтруктурКолонок Цикл
		Если Найти(КромеИменКолонок,Колонка.Имя) Тогда
			Продолжить;
		КонецЕсли;
		Если Колонка.ТипЗначения = ОписаниеТиповТаблица Тогда
			ОписаниеТипов = ОписаниеТиповСтрока;
		Иначе
			ОписаниеТипов = новый ОписаниеТипов(Колонка.ТипЗначения);
		КонецЕсли;
		НовыйРеквизит = Новый РеквизитФормы(Колонка.Имя, ОписаниеТипов, ИмяТаблицы, Колонка.Имя, Ложь);
		МассивДобавляемыхЭлементов.Добавить(НовыйРеквизит);
	КонецЦикла;
	
	Если МассивДобавляемыхЭлементов.Количество()=0 И МассивУдаляемыхЭлементов.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.ИзменитьРеквизиты(МассивДобавляемыхЭлементов,МассивУдаляемыхЭлементов);
	
	Для каждого Колонка из МассивСтруктурКолонок Цикл                       
		Если Найти(КромеИменКолонок,Колонка.Имя) Тогда
			Продолжить;
		КонецЕсли;
		СледующийЭлемент = Неопределено;
		Если НЕ Колонка.ИмяСледующегоЭлемента=Неопределено Тогда
			СледующийЭлемент = Элементы.Найти(Колонка.ИмяСледующегоЭлемента);
		КонецЕсли;
		НовыйЭлемент = Элементы.Вставить(Элементы[ИмяТаблицы].Имя+Колонка.Имя, Тип("Полеформы"), Элементы[ИмяТаблицы],СледующийЭлемент);
		Если Колонка.ТипСтрокой="Булево" Или  Колонка.ТипСтрокой="Boolean"Тогда
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		Иначе
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.Высота = 0;
			НовыйЭлемент.Ширина = Колонка.Ширина;                
		КонецЕсли;
		НовыйЭлемент.Видимость = Истина;
		НовыйЭлемент.Доступность = Истина;
		НовыйЭлемент.ТолькоПросмотр = Колонка.ТолькоПросмотр;   
		НовыйЭлемент.Заголовок = Колонка.Заголовок;
		НовыйЭлемент.Подсказка = Колонка.Заголовок;
		НовыйЭлемент.ПутьКДанным = ИмяТаблицы+"."+Колонка.Имя;    
	КонецЦикла;
	
	
КонецПроцедуры         
