
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(Замер) Тогда
		ЗагрузитьНастройки(Неопределено);
	КонецЕсли;
	Элементы.ФункцияАгрегацииДополнительногоСвойства.СписокВыбора.Добавить("Максимум");
	Элементы.ФункцияАгрегацииДополнительногоСвойства.СписокВыбора.Добавить("Слияние");
	Элементы.ФункцияАгрегацииДополнительногоСвойства.СписокВыбора.Добавить("Сумма");
	Элементы.ФункцияАгрегацииДополнительногоСвойства.СписокВыбора.Добавить("Минимум");
	Элементы.ФункцияАгрегацииДополнительногоСвойства.СписокВыбора.Добавить("Первое");
	Элементы.ФункцияАгрегацииДополнительногоСвойства.СписокВыбора.Добавить("Последнее");
	Если НЕ ЗначениеЗаполнено(ФункцияАгрегацииДополнительногоСвойства) Тогда
		ФункцияАгрегацииДополнительногоСвойства = "Первое";
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура СохранитьНастройки(Команда)
	мНастройка = новый Структура();
	
	мНастройка.Вставить("ЗамерИсточник",ЗамерИсточник);
	мНастройка.Вставить("Свойство",Свойство);
	
	мНастройка.Вставить("РазмерПакета",РазмерПакета);
	мНастройка.Вставить("Аналитика1",Аналитика1);
	мНастройка.Вставить("Аналитика2",Аналитика2);
	мНастройка.Вставить("ГруппировкаБезПериода",ГруппировкаБезПериода);
	мНастройка.Вставить("ГруппировкаГод",ГруппировкаГод);
	мНастройка.Вставить("ГруппировкаДень",ГруппировкаДень);
	мНастройка.Вставить("ГруппировкаМесяц",ГруппировкаМесяц);
	мНастройка.Вставить("ГруппировкаНеделя",ГруппировкаНеделя);
	
	мНастройка.Вставить("ДополнительноеСвойство",ДополнительноеСвойство);
	мНастройка.Вставить("ФункцияАгрегацииДополнительногоСвойства",ФункцияАгрегацииДополнительногоСвойства);
	
	                                               
	мНастройка.Вставить("УдалятьЦифры",УдалятьЦифры);
	мНастройка.Вставить("УдалятьСпецСимволы",УдалятьСпецСимволы);
	
	УправлениеХранилищемНастроекВызовСервера.ЗаписатьДанныеВБезопасноеХранилищеРасширенный(Замер,мНастройка,"Настройка частотного анализа по замеру");
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройки(Команда)
	мНастройка = УправлениеХранилищемНастроекВызовСервера.ДанныеИзБезопасногоХранилища(Замер);
	Если мНастройка<>Неопределено Тогда
		ЗамерИсточник = мНастройка.ЗамерИсточник;
		Свойство = мНастройка.Свойство;
		РазмерПакета = мНастройка.РазмерПакета;
		Аналитика1 = мНастройка.Аналитика1;
		Аналитика2 = мНастройка.Аналитика2;
		ГруппировкаБезПериода = мНастройка.ГруппировкаБезПериода;
		ГруппировкаГод = мНастройка.ГруппировкаГод;
		ГруппировкаДень = мНастройка.ГруппировкаДень;
		ГруппировкаМесяц = мНастройка.ГруппировкаМесяц;
		ГруппировкаНеделя = мНастройка.ГруппировкаНеделя;
		
		ДополнительноеСвойство = мНастройка.ДополнительноеСвойство;
		ФункцияАгрегацииДополнительногоСвойства = мНастройка.ФункцияАгрегацииДополнительногоСвойства;
		
		УдалятьЦифры = мНастройка.УдалятьЦифры;
		УдалятьСпецСимволы = мНастройка.УдалятьСпецСимволы;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОбработкуНаСервере()
	мОбъект = РеквизитФормыВЗначение("Объект");
	мОбъект.ВыполнитьЧастотныйАнализСобытий(Замер);
КонецПроцедуры


&НаКлиенте
Процедура ВыполнитьОбработку(Команда)
	ВыполнитьОбработкуНаСервере();
КонецПроцедуры


&НаСервере
Процедура СформироватьКлючиНаСервере()
	// нужно добавить ключи, если нет
	
КонецПроцедуры


&НаКлиенте
Процедура СформироватьКлючи(Команда)
	СформироватьКлючиНаСервере();
КонецПроцедуры

