// TODO: используем вариант реализации стеммер портера
// хорошо бы переписать, но пока оставим так

// Функция - Применить стеммер портера
//
// Параметры:
//  Слово	 - строка - слово
// 
// Возвращаемое значение:
//  строка - обработанное слово по алгоритму стеммер Портера
//
Функция ПрименитьСтеммерПортера(Слово) Экспорт

	//http://snowball.tartarus.org/algorithms/russian/stemmer.html
	
	Стем	= Слово;
	Стем	= НРег(Стем);
	Стем	= СтрЗаменить(Стем, "ё", "е");

	ПозицияРВ	= 0;//Позиция относительно начала слова
	ПозицияР1	= 0;//позиция относительно начала РВ
	ПозицияР2	= 0;//позиция относительно начала РВ

	ПолучитьПозиции(Стем, ПозицияРВ, ПозицияР1, ПозицияР2);
	
	Если ПозицияРВ = 0 Тогда
		Возврат Стем;
	КонецЕсли; 
	РВ		= Сред(Стем,ПозицияРВ);
	Старт	= Лев(Стем, ПозицияРВ-1);
	Если НЕ ЗначениеЗаполнено(РВ) Тогда
		Возврат Стем;
	КонецЕсли;
	
	//Шаг 1
	Если НЕ PerfectiveGerund(РВ) Тогда
		Reflexive(РВ);
		Если Adjectival(РВ) Тогда
		ИначеЕсли Verb(РВ) Тогда
		Иначе
			Noun(РВ);
		КонецЕсли;
		
	КонецЕсли; 
	//Шаг 2
	Если Прав(РВ,1) = "и" Тогда
		РВ	= Лев(РВ, СтрДлина(РВ)-1);
	КонецЕсли; 
	//Шаг 3
	Если ПозицияР2 > 0 И СтрДлина(РВ) > ПозицияР2 Тогда
		СтрокаР2	= Сред(РВ, ПозицияР2);
		Derivational(РВ, СтрокаР2);
	КонецЕсли; 
	//Шаг 4
	Если Прав(РВ,1) = "ь" Тогда
		РВ	= Лев(РВ, СтрДлина(РВ)-1);
	Иначе
		Если Прав(РВ,4) = "ейше" Тогда
			РВ	= Лев(РВ, СтрДлина(РВ)-4);
		ИначеЕсли Прав(РВ,3) = "ейш" Тогда
			РВ	= Лев(РВ, СтрДлина(РВ)-3);
		КонецЕсли;
		Если Прав(РВ,2) = "нн" Тогда
			РВ	= Лев(РВ, СтрДлина(РВ)-1);
		КонецЕсли;
	КонецЕсли;

	Возврат Старт + РВ;
	
КонецФункции // Стемминг()

Процедура ПолучитьПозиции(Строка, РВ, Р1, Р2)

	РВ	= 0;
	Р1	= 0;
	Р2	= 0;
	
	Гласные	= "аеиоуыэюя";
	
	//Определение РВ
	Длина	= СтрДлина(Строка);
	Для Сч = 1 По Длина - 1 Цикл
		Символ	= Сред(Строка,Сч,1);
		Если Найти(Гласные, Символ) > 0 Тогда
			РВ	= Сч + 1;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если РВ = 0 Тогда
		Возврат;
	КонецЕсли;
	//Определение Р1
	СтрокаРВ= Сред(Строка, РВ);
	Длина	= СтрДлина(СтрокаРВ);
	Для Сч = 1 По Длина - 1 Цикл
		Символ	= Сред(СтрокаРВ,Сч,1);
		Символ1	= Сред(СтрокаРВ,Сч+1,1);
		Если Найти(Гласные, Символ) = 0 И Найти(Гласные, Символ1) > 0 Тогда
			Р1	= Сч + 1;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если Р1 = 0 Тогда
		Возврат;
	КонецЕсли;
	//Определение Р2
	СтрокаР1= Сред(СтрокаРВ, Р1);
	Длина	= СтрДлина(СтрокаР1);
	Для Сч = 1 По Длина - 1 Цикл
		Символ	= Сред(СтрокаР1,Сч,1);
		Символ1	= Сред(СтрокаР1,Сч+1,1);
		Если Найти(Гласные, Символ) = 0 И Найти(Гласные, Символ1) > 0 Тогда
			Р2	= Р1 + Сч;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат;
	
	
КонецПроцедуры

Функция PerfectiveGerund(Строка)

	Длина	= СтрДлина(Строка);
	Если Длина >= 6 Тогда
		С6	= Прав(Строка,6);
		Если Найти("ившись|ывшись", С6) > 0 Тогда
			Строка	= Лев(Строка, СтрДлина(Строка)-6);
			Возврат Истина;
		ИначеЕсли Найти("авшись|явшись", С6) > 0 Тогда
			Строка	= Лев(Строка, СтрДлина(Строка)-5);
			Возврат Истина;
		КонецЕсли;
	КонецЕсли; 
	Если Длина >= 4 Тогда
		С4	= Прав(Строка,4);
		Если Найти("ивши|ывши", С4) > 0 Тогда
			Строка	= Лев(Строка, СтрДлина(Строка)-4);
			Возврат Истина;
		ИначеЕсли Найти("авши|явши", С4) > 0 Тогда
			Строка	= Лев(Строка, СтрДлина(Строка)-3);
			Возврат Истина;
		КонецЕсли;
	КонецЕсли; 
	Если Длина >= 2 Тогда
		С2	= Прав(Строка,2);
		Если Найти("ив|ыв", С2) > 0 Тогда
			Строка	= Лев(Строка, СтрДлина(Строка)-2);
			Возврат Истина;
		ИначеЕсли Найти("ав|яв", С2) > 0 Тогда
			Строка	= Лев(Строка, СтрДлина(Строка)-1);
			Возврат Истина;
		КонецЕсли;
	КонецЕсли; 
	
	Возврат Ложь;

КонецФункции // PerfectiveGround()

Функция Reflexive(Строка)

	Длина	= СтрДлина(Строка);
	Если Длина >= 2 Тогда
		С2	= Прав(Строка,2);
		Если Найти("ся|сь", С2) > 0 Тогда
			Строка	= Лев(Строка, СтрДлина(Строка)-2);
			Возврат Истина;
		КонецЕсли; 
	КонецЕсли;

	Возврат Ложь;

КонецФункции // Reflexive()

Функция Adjectival(Строка)

	Длина	= СтрДлина(Строка);
	Найдено	= Ложь;
	Если Длина >= 3 Тогда
		С3	= Прав(Строка,3);
		Если Найти("ими|ыми|его|ого|ему|ому", С3) > 0 Тогда
			Строка	= Лев(Строка, СтрДлина(Строка)-3);
			Длина	= Длина - 3;
			Найдено	= Истина;
		КонецЕсли;
	КонецЕсли;
	Если (НЕ Найдено) И (Длина >= 2) Тогда
		С2	= Прав(Строка,2);
		Если Найти("ее|ие|ые|ое|ей|ий|ый|ой|ем|им|ым|ом|их|ых|ую|юю|ая|яя|ою|ею", С2) > 0 Тогда
			Строка	= Лев(Строка, СтрДлина(Строка)-2);
			Длина	= Длина - 2;
			Найдено	= Истина;
		КонецЕсли;
	КонецЕсли;
	Если Найдено Тогда
		Если Длина >= 3 Тогда
			С3	= Прав(Строка,3);
			Если Найти("ивш|ывш|ующ", С3) > 0 Тогда
				Строка	= Лев(Строка, СтрДлина(Строка)-3);
				Возврат	Истина;
			ИначеЕсли Найти("аем|анн|авш|ающ|яем|янн|явш|яющ", С3) > 0 Тогда
				Строка	= Лев(Строка, СтрДлина(Строка)-2);
				Возврат	Истина;
			КонецЕсли;
		КонецЕсли; 
		Если Длина >= 2 Тогда
			С2	= Прав(Строка,2);
			Если Найти("ащ|ящ", С2) > 0 Тогда
				Строка	= Лев(Строка, СтрДлина(Строка)-1);
				Возврат	Истина;
			КонецЕсли;
		КонецЕсли;
		Возврат Истина;
	КонецЕсли; 

	Возврат Ложь;

КонецФункции // Adjectival()

Функция Verb(Строка)

	Длина	= СтрДлина(Строка);
	Если Длина >= 4 Тогда
		С4	= Прав(Строка,4);
		Если Найти("ейте|уйте", С4) > 0 Тогда
			Строка	= Лев(Строка, СтрДлина(Строка)-4);
			Возврат Истина;
		ИначеЕсли Найти("аете|айте|аешь|анно|яете|яйте|яешь|янно", С4) > 0 Тогда
			Строка	= Лев(Строка, СтрДлина(Строка)-3);
			Возврат Истина;
		КонецЕсли;
	КонецЕсли; 
	Если Длина >= 3 Тогда
		С3	= Прав(Строка,3);
		Если Найти("ила|ыла|ена|ите|или|ыли|ило|ыло|ено|ует|уют|ены", С3) > 0 Тогда
			Строка	= Лев(Строка, СтрДлина(Строка)-3);
			Возврат Истина;
		ИначеЕсли Найти("ала|ана|али|аем|ало|ано|ает|ают|аны|ать|аешь|яла|яна|яли|яем|яло|яно|яет|яют|яны|ять|яешь", С3) > 0 Тогда
			Строка	= Лев(Строка, СтрДлина(Строка)-2);
			Возврат Истина;
		КонецЕсли;
	КонецЕсли; 
	Если Длина >= 2 Тогда
		С2	= Прав(Строка,2);
		Если Найти("ей|уй|ил|ыл|им|ым|ен|ят|ит|ыт|ую", С2) > 0 Тогда
			Строка	= Лев(Строка, СтрДлина(Строка)-2);
			Возврат Истина;
		ИначеЕсли Найти("ай|ал|ан|яй|ял|ян", С2) > 0 Тогда
			Строка	= Лев(Строка, СтрДлина(Строка)-1);
			Возврат Истина;
		КонецЕсли;
	КонецЕсли; 
	Если Длина >= 1 Тогда
		С1	= Прав(Строка,1);
		Если С1	= "ю" Тогда
			Строка	= Лев(Строка, СтрДлина(Строка)-1);
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;

	Возврат Ложь;

КонецФункции // Verb()

Функция Noun(Строка)

	Длина	= СтрДлина(Строка);
	Если Длина >= 4 Тогда
		С4	= Прав(Строка,4);
		Если Найти("иями", С4) > 0 Тогда
			Строка	= Лев(Строка, СтрДлина(Строка)-4);
			Возврат Истина;
		КонецЕсли;
	КонецЕсли; 
	Если Длина >= 3 Тогда
		С3	= Прав(Строка,3);
		Если Найти("ями|ами|ией|иям|ием|иях", С3) > 0 Тогда
			Строка	= Лев(Строка, СтрДлина(Строка)-3);
			Возврат Истина;
		КонецЕсли;
	КонецЕсли; 
	Если Длина >= 2 Тогда
		С2	= Прав(Строка,2);
		Если Найти("ев|ов|ие|ье|еи|ии|ей|ой|ий|ям|ем|ам|ом|ах|ях|ию|ью|ия|ья", С2) > 0 Тогда
			Строка	= Лев(Строка, СтрДлина(Строка)-2);
			Возврат Истина;
		КонецЕсли;
	КонецЕсли; 
	Если Длина >= 1 Тогда
		С1	= Прав(Строка,1);
		Если Найти("а|е|и|й|о|у|ы|ь|ю|я", С1) > 0 Тогда
			Строка	= Лев(Строка, СтрДлина(Строка)-1);
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;

	Возврат Ложь;

КонецФункции // Noun()

Функция Derivational(Строка, Р2)

	Если Лев(Р2, 4) = "ость" Тогда
		Строка	= Лев(Строка, СтрДлина(Строка)-4);
		Возврат Истина;
	ИначеЕсли Лев(Р2, 3) = "ост" Тогда
		Строка	= Лев(Строка, СтрДлина(Строка)-3);
		Возврат Истина;
	КонецЕсли;

	Возврат Ложь;

КонецФункции // Reflexive()

