
Функция ВходЗапрещен() Экспорт
	
	Возврат ПараметрыСеанса.ТекущийПользователь.Недействителен;
	
КонецФункции


Процедура УстановитьГлавныйСтильИзНастроек() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Запрос = новый Запрос;
	Запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
	|	Т.ИмяСтиля КАК ИмяСтиля
	|ИЗ
	|	РегистрСведений.НастройкиПользователя КАК Т
	|ГДЕ
	|	Т.Пользователь = &Пользователь";
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ИмяСтиля = Выборка.ИмяСтиля;
		Если ЗначениеЗаполнено(ИмяСтиля) Тогда
			Попытка
				Стиль = БиблиотекаСтилей[ИмяСтиля];
				ГлавныйСтиль = Стиль;
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры