&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ИспользоватьФаззификациюПриИзменении(Неопределено);
КонецПроцедуры


&НаКлиенте
Процедура Тест(Команда)
	ТестНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТестНаСервере()
	
	мОбработка = РеквизитФормыВЗначение("Объект");

	мНастройка = новый Структура();
	мНастройка.Вставить("АдресСервера",АдресСервера);
	мНастройка.Вставить("Порт",Порт);
	мНастройка.Вставить("ИмяБазы",ИмяБазы);
	мНастройка.Вставить("Логин",Логин);
	мНастройка.Вставить("Пароль",Пароль);
	мНастройка.Вставить("Таймаут",Таймаут);
	мНастройка.Вставить("ИспользоватьАутентификациюОС",ИспользоватьАутентификациюОС);
	мНастройка.Вставить("SSL",SSL);


	ДанныеПодключения = мОбработка.ПолучитьДанныеПодключения();
	ЗаполнитьЗначенияСвойств(ДанныеПодключения,мНастройка);
	СтруктураОтвета = мОбработка.ТестНаСервере(ДанныеПодключения);
	
	ТекстОшибки = СтруктураОтвета.ТекстОшибки;
	КодСостояния = СтруктураОтвета.Успешно;
	Длительность = СтруктураОтвета.Длительность;
	
КонецПроцедуры


&НаКлиенте
Процедура СохранитьНастройки(Команда)
	мНастройка = новый Структура();
	мНастройка.Вставить("АдресСервера",АдресСервера);
	мНастройка.Вставить("Порт",Порт);
	мНастройка.Вставить("ИмяБазы",ИмяБазы);
	мНастройка.Вставить("Логин",Логин);
	мНастройка.Вставить("Пароль",Пароль);
	мНастройка.Вставить("Таймаут",Таймаут);
	мНастройка.Вставить("ИспользоватьАутентификациюОС",ИспользоватьАутентификациюОС);
	мНастройка.Вставить("SSL",SSL);
	мНастройка.Вставить("ИспользоватьФаззификацию",ИспользоватьФаззификацию);
	мНастройка.Вставить("ТаблицаФаззификации",новый Массив);
	
	Для каждого стр из ТаблицаФаззификации Цикл
		мНастройка.ТаблицаФаззификации.Добавить(новый Структура("терм,от,до",стр.терм,стр.от,стр.до));	
	КонецЦикла;
	
	УправлениеХранилищемНастроекВызовСервера.ЗаписатьДанныеВБезопасноеХранилищеРасширенный(Замер,мНастройка,"Настройка мониторинга 1С сервиса RemoteControl через интерфейс http по SOAP");
КонецПроцедуры


&НаКлиенте
Процедура ЗагрузитьНастройки(Команда)
	мНастройка = УправлениеХранилищемНастроекВызовСервера.ДанныеИзБезопасногоХранилища(Замер);
	Если мНастройка<>Неопределено Тогда
		АдресСервера = мНастройка.АдресСервера;
		Порт = мНастройка.Порт;
		ИмяБазы = мНастройка.ИмяБазы;
		Логин = мНастройка.Логин;
		Пароль = мНастройка.Пароль;
		Таймаут = мНастройка.Таймаут;
		ИспользоватьАутентификациюОС = мНастройка.ИспользоватьАутентификациюОС;
		SSL = мНастройка.SSL;
		ИспользоватьФаззификацию = мНастройка.ИспользоватьФаззификацию;
		
		ТаблицаФаззификации.Очистить();
		
		Для каждого стр из мНастройка.ТаблицаФаззификации Цикл
			стр_н = ТаблицаФаззификации.Добавить();
			ЗаполнитьЗначенияСвойств(стр_н,стр);
		КонецЦикла;
		
	КонецЕсли;
	ИспользоватьФаззификациюПриИзменении(Неопределено);
КонецПроцедуры


&НаСервере
Процедура ЗагрузитьДпнныеНаСервере()
	
	мОбработка = РеквизитФормыВЗначение("Объект");
	мОбработка.ВыполнитьЗамер(Замер);
	
КонецПроцедуры


&НаКлиенте
Процедура ЗагрузитьДанные(Команда)
	ЗагрузитьДпнныеНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ИспользоватьФаззификациюПриИзменении(Элемент)
	Элементы.ТаблицаФаззификации.Видимость = ИспользоватьФаззификацию;
КонецПроцедуры



