
// Возвращает текущего авторизованного пользователя.
Функция АвторизованныйПользователь() Экспорт
	Возврат ПараметрыСеанса.ТекущийПользователь;
КонецФункции


Процедура УстановитьПараметры(ПараметрыСеанса) Экспорт
	
	// получим компьютер
	УстановитьПривилегированныйРежим(Истина);
	
	
	// определим пользователя
	ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
	// найдем пользователя
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Пользователи.Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.ИдентификаторПользователяИБ = &ИдентификаторПользователяИБ";
	Запрос.УстановитьПараметр("ИдентификаторПользователяИБ",ПользовательИБ.УникальныйИдентификатор);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			ПараметрыСеанса.ТекущийПользователь = Выборка.Ссылка;
		Иначе
			ПараметрыСеанса.ТекущийПользователь =  Справочники.Пользователи.ПустаяСсылка();
		КонецЕсли;
	Иначе
		// пользователь по умолчанию
		ПараметрыСеанса.ТекущийПользователь =  Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры


Функция ТекущийПользователь() Экспорт
	Возврат ПараметрыСеанса.ТекущийПользователь;
КонецФункции

Функция ВходЗапрещен() Экспорт
	
	Возврат ПользователиСервер.ВходЗапрещен();
	
КонецФункции

Процедура УстановитьГлавныйСтильИзНастроек() Экспорт
	
	ПользователиСервер.УстановитьГлавныйСтильИзНастроек();
	
КонецПроцедуры