
// пробросили из клиента
Функция ЗначенияРеквизитовОбъекта(Ссылка, Знач Реквизиты, ВыбратьРазрешенные = Ложь) Экспорт
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, Реквизиты, ВыбратьРазрешенные );
КонецФункции

Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита, ВыбратьРазрешенные = Ложь) Экспорт
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита, ВыбратьРазрешенные );
КонецФункции

Функция ЦветСтиля(ИмяЦветаСтиля) Экспорт
	Возврат ЦветаСтиля[ИмяЦветаСтиля];
КонецФункции

Функция ШрифтСтиля(ИмяШрифтаСтиля) Экспорт
	Возврат ШрифтыСтиля[ИмяШрифтаСтиля];
КонецФункции
