#Область ОбработчикиЭлементовФормы

&НаКлиенте
Процедура ПолныйПутьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Д = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Д.Каталог = Объект.ПолныйПуть;
	Д.Показать(Новый ОписаниеОповещения("ПолныйПутьВыбор", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура СостояниеРЗНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(НастройкиРЗ) <> Тип("РасписаниеРегламентногоЗадания") Тогда
		НастройкиРЗ = Новый РасписаниеРегламентногоЗадания;
	КонецЕсли;
	
	Обработчик = Новый ОписаниеОповещения("ИзменитьРегламентноеЗаданиеЗавершение", ЭтотОбъект);
	
	РедактированиеРасписания = Новый ДиалогРасписанияРегламентногоЗадания(НастройкиРЗ);
	РедактированиеРасписания.Показать(Обработчик);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьРегламентноеЗаданиеЗавершение(Расписание, ДополнительныеПараметры) Экспорт
	Если Расписание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиРЗ = Расписание;
	СостояниеРЗ = Строка(Расписание);
	Если ЗагружатьАвтоматически = Ложь Тогда
		ЗагружатьАвтоматически = Истина;
	КонецЕсли;
	
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗагружатьАвтоматическиПриИзменении(Элемент)
	Если ЗагружатьАвтоматически 
		И НастройкиРЗ = Неопределено Тогда
			СостояниеРЗНажатие(Неопределено, Неопределено);
	ИначеЕсли НЕ ЗагружатьАвтоматически 
		И НастройкиРЗ <> Неопределено Тогда
		НастройкиРЗ = Неопределено;
		УстановитьПредставлениеСостоянияРЗ(ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеРЗ()
	НастройкиРЗ = Неопределено;
	ЗагружатьАвтоматически = Ложь;
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если (Объект.ИдентификаторРЗ <> Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")) Тогда
			РЗ = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Объект.ИдентификаторРЗ);
			Если РЗ<>Неопределено 
				И РЗ.Использование Тогда
				ЗагружатьАвтоматически = Истина;					
				НастройкиРЗ = РЗ.Расписание;
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли;
	УстановитьПредставлениеСостоянияРЗ(ЭтаФорма);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПредставлениеСостоянияРЗ(Форма)
	Форма.СостояниеРЗ = ?(Форма.ЗагружатьАвтоматически, Строка(Форма.НастройкиРЗ), "<Отключено>");
КонецПроцедуры

&НаКлиенте
Процедура ПолныйПутьВыбор(Результат, Параметры) Экспорт
	Если Результат <> Неопределено И Результат.Количество() Тогда
		Объект.ПолныйПуть = Результат[0];
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПриСозданииЧтенииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииЧтенииНаСервере()
	УстановитьСостояниеРЗ();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	УстановитьСостояниеРЗ();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ЗагружатьАвтоматически", ЗагружатьАвтоматически);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("НастройкиРЗ", НастройкиРЗ);
КонецПроцедуры

#КонецОбласти




