
&НаКлиенте
Процедура Команда1(Команда)
	Команда1НаСервере();
	ВопросПерезапуститьСистему();
КонецПроцедуры


&НаСервереБезКонтекста
Процедура Команда1НаСервере()

	// если уже установлен необходимый интерфейс
	// установим интерфейс
	НКП = новый НастройкиКлиентскогоПриложения;
	
	// Вариант расположения интерфейса
	НКП.ВариантМасштабаФормКлиентскогоПриложения=ВариантМасштабаФормКлиентскогоПриложения.Компактный;
	НКП.ВариантИнтерфейсаКлиентскогоПриложения=ВариантИнтерфейсаКлиентскогоПриложения.Такси;
	
	ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиКлиентскогоПриложения",,НКП);		
	
КонецПроцедуры	

&НаСервере
Процедура ОбычныйТаксиНаСервере()
	// если уже установлен необходимый интерфейс
	// установим интерфейс
	НКП = новый НастройкиКлиентскогоПриложения;
	
	// Вариант расположения интерфейса
	НКП.ВариантМасштабаФормКлиентскогоПриложения=ВариантМасштабаФормКлиентскогоПриложения.Обычный;
	НКП.ВариантИнтерфейсаКлиентскогоПриложения=ВариантИнтерфейсаКлиентскогоПриложения.Такси;
	
	ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиКлиентскогоПриложения",,НКП);		
КонецПроцедуры

&НаКлиенте
Процедура ОбычныйТакси(Команда)
	ОбычныйТаксиНаСервере();
	ВопросПерезапуститьСистему();
КонецПроцедуры

&НаКлиенте
Процедура ВопросПерезапуститьСистему()
	ПоказатьВопрос(Новый ОписаниеОповещения("ПерезапуститьСистемуЗавершение",ЭтотОбъект),"Перезапустить систему?",РежимДиалогаВопрос.ДаНет,30);
КонецПроцедуры

&НаКлиенте
Процедура ПерезапуститьСистемуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗавершитьРаботуСистемы(Истина,Истина);
	КонецЕсли;
КонецПроцедуры
