
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЗначениеЗаполнено(ШиринаОкна) Тогда
		ШиринаОкна = "День";
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(НачалоПериода1) Тогда
		НачалоПериода1 = НачалоДня(ТекущаяДата());
	КонецЕсли;
	СформироватьГрафикМониторинга();
КонецПроцедуры

&НаСервере
Процедура СформироватьГрафикМониторинга()
	
	Перем Выборка, КоличествоОшибок, КоличествоПровалов, КоличествоПропущенных, КоличествоТестовыхСлучаев, КоличествоУспешных, СерияОшибки, СерияПадения, СерияПропуски, СерияУспешно, Статусы, ТочкаДиаграммы;
	
	// нет свойств и не надо рисовать
	Если Свойства.Количество()=0 Тогда
		Возврат; 
	КонецЕсли;
	
	Диаграмма_Мониторинга.Очистить();

	
	// настройки графика
	Если НЕ ЗначениеЗаполнено(ВидГрафика_Мониторинга) Тогда
		ВидГрафика_Мониторинга="Гистограмма";
	КонецЕсли;
	Элементы.ВидГрафика_Мониторинга.РежимВыбораИзСписка = Истина;
	Элементы.ВидГрафика_Мониторинга.РедактированиеТекста = Ложь;
	Элементы.ВидГрафика_Мониторинга.СписокВыбора.Очистить();
	Элементы.ВидГрафика_Мониторинга.СписокВыбора.Добавить("Гистограмма");
	Элементы.ВидГрафика_Мониторинга.СписокВыбора.Добавить("График");
	Элементы.ВидГрафика_Мониторинга.СписокВыбора.Добавить("ГистограммаОбъемная");
	Элементы.ВидГрафика_Мониторинга.СписокВыбора.Добавить("ГрафикСОбластями");
	

	Диаграмма_Мониторинга.ТипДиаграммы=ТипДиаграммы[ВидГрафика_Мониторинга];
	
	СерияОкон = новый Соответствие();
	
	
	
	Для каждого стр из Свойства Цикл 
		СерияОкно1 = Диаграмма_Мониторинга.УстановитьСерию(стр.Значение);
		СерияОкон.Вставить(стр.Значение,СерияОкно1);
	КонецЦикла;
	
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СРЕДНЕЕ(ВЫБОР
	|			КОГДА СобытияЗамера.Свойство.Процент
	|				ТОГДА СобытияЗамера.ЗначениеЧисло * 100
	|			ИНАЧЕ СобытияЗамера.ЗначениеЧисло
	|		КОНЕЦ) КАК Значение,
	|	СобытияЗамера.Свойство КАК Свойство,
	|	-РАЗНОСТЬДАТ(СобытияЗамера.Ссылка.ДатаСобытия, &Интервал1Начало, ЧАС) КАК КоличествоЧасовОтНачалаИнтервала
	|ПОМЕСТИТЬ ВтПовторенияИнтервал1
	|ИЗ
	|	Справочник.СобытияЗамера.КлючевыеСвойства КАК СобытияЗамера
	|ГДЕ
	|	СобытияЗамера.Ссылка.Владелец = &Замер
	|	И СобытияЗамера.Свойство В(&МассивСвойств)
	|	И СобытияЗамера.Ссылка.ДатаСобытия МЕЖДУ &Интервал1Начало И &Интервал1Окончание
	|
	|СГРУППИРОВАТЬ ПО
	|	СобытияЗамера.Свойство,
	|	-РАЗНОСТЬДАТ(СобытияЗамера.Ссылка.ДатаСобытия, &Интервал1Начало, ЧАС)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	0 КАК КоличествоЧасовОтНачалаИнтервала
	|ПОМЕСТИТЬ ВтШкалаВремени
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	1
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	2
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	3
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	4
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	5
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	6
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	7
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	8
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	9
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	10
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	11
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	12
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	13
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	14
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	15
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	16
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	17
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	18
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	19
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	20
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	21
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	22
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	23
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	24
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВтОбъединениеНаШкале.КоличествоЧасовОтНачалаИнтервала, ВтШкалаВремени.КоличествоЧасовОтНачалаИнтервала) КАК КоличествоЧасовОтНачалаИнтервала,
	|	ЕСТЬNULL(ВтОбъединениеНаШкале.Свойство, НЕОПРЕДЕЛЕНО) КАК Свойство,
	|	ЕСТЬNULL(ВтОбъединениеНаШкале.Значение, 0) КАК Значение
	|ИЗ
	|	ВтПовторенияИнтервал1 КАК ВтОбъединениеНаШкале
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВтШкалаВремени КАК ВтШкалаВремени
	|		ПО ВтОбъединениеНаШкале.КоличествоЧасовОтНачалаИнтервала = ВтШкалаВремени.КоличествоЧасовОтНачалаИнтервала
	|
	|УПОРЯДОЧИТЬ ПО
	|	КоличествоЧасовОтНачалаИнтервала";
	
	ШиринаОкнаСекунды = 24*60*60;
	
	Запрос.УстановитьПараметр("Замер",Замер);
	Запрос.УстановитьПараметр("Интервал1Начало",НачалоПериода1);
	Запрос.УстановитьПараметр("Интервал1Окончание",НачалоПериода1+ШиринаОкнаСекунды);
	Запрос.УстановитьПараметр("МассивСвойств",Свойства.ВыгрузитьЗначения());
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	

	Пока Выборка.Следующий() Цикл
		
		ТочкаДиаграммы = Диаграмма_Мониторинга.УстановитьТочку(Выборка.КоличествоЧасовОтНачалаИнтервала);
		
		//СерияОкно1.Цвет = новый Цвет(155,50,50);	
		
		СерияОкно = СерияОкон.Получить(Выборка.Свойство);
		Если НЕ СерияОкно=Неопределено Тогда
			Диаграмма_Мониторинга.УстановитьЗначение(ТочкаДиаграммы,СерияОкно, Выборка.Значение);
		КонецЕсли;
		
		
	КонецЦикла;
	
	
	Диаграмма_Мониторинга.ВидПодписей=ВидПодписейКДиаграмме.Значение;

КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	СформироватьГрафикМониторинга();
КонецПроцедуры

&НаКлиенте
Процедура Вперед(Команда)
	ШиринаОкнаСекунды = 24*60*60;
	НачалоПериода1 = НачалоПериода1 + ШиринаОкнаСекунды;
	СформироватьГрафикМониторинга();
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	ШиринаОкнаСекунды = 24*60*60;
	НачалоПериода1 = НачалоПериода1 - ШиринаОкнаСекунды;
	СформироватьГрафикМониторинга();
КонецПроцедуры

&НаКлиенте
Процедура ВидГрафика_МониторингаПриИзменении(Элемент)
	СформироватьГрафикМониторинга();
КонецПроцедуры

&НаКлиенте
Процедура ЗамерПриИзменении(Элемент)
	СформироватьГрафикМониторинга();
КонецПроцедуры

