
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьМодельНаСервере(Данные)
	
	УправлениеХранилищемНастроекВызовСервера.ЗаписатьДанныеВБезопасноеХранилищеРасширенный(Объект.Ссылка,Данные,"Модель нейронной сети","Модель");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьМодель(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		Сообщить("Запишите объект прежде!");
		Возврат;
	КонецЕсли;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие); 
	Диалог.Заголовок = "Выберите файл модели"; 
	Диалог.ПолноеИмяФайла = ""; 
	Фильтр = "XML-файл (*.xml)|*.xml"; 
	Диалог.Фильтр = Фильтр; 
	Диалог.МножественныйВыбор = Ложь; 
	ВыборФайлаОткрытияФайла = новый ОписаниеОповещения("ВыборФайлаОткрытияФайла",ЭтотОбъект,новый Структура("Сохранение",Истина));
	Диалог.Показать(ВыборФайлаОткрытияФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаОткрытияФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено И ВыбранныеФайлы.Количество() > 0 Тогда
		Если ДополнительныеПараметры.Сохранение=Истина Тогда
			ТекстовыйДокумент = новый ТекстовыйДокумент;
			ТекстовыйДокумент.Прочитать(ВыбранныеФайлы[0],"UTF8");
			Данные = ТекстовыйДокумент.ПолучитьТекст();
			ЗагрузитьМодельНаСервере(Данные);
		Иначе
			Данные = ВыгрузитьМодельНаСервере();
			Если НЕ Данные=Неопределено Тогда
				ТекстовыйДокумент = Новый ТекстовыйДокумент;
				ТекстовыйДокумент.УстановитьТекст(Данные);
				ТекстовыйДокумент.Записать(ВыбранныеФайлы[0],"UTF8");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ВыгрузитьМодельНаСервере()
	Данные = УправлениеХранилищемНастроекВызовСервера.ДанныеИзБезопасногоХранилища(Объект.Ссылка,"Модель");
	Возврат Данные;
КонецФункции

&НаКлиенте
Процедура ВыгрузитьМодель(Команда)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие); 
	Диалог.Заголовок = "Выберите файл модели"; 
	Диалог.ПолноеИмяФайла = ""; 
	Фильтр = "XML-файл (*.xml)|*.xml"; 
	Диалог.Фильтр = Фильтр; 
	Диалог.МножественныйВыбор = Ложь; 
	ВыборФайлаОткрытияФайла = новый ОписаниеОповещения("ВыборФайлаОткрытияФайла",ЭтотОбъект,новый Структура("Сохранение",Ложь));
	Диалог.Показать(ВыборФайлаОткрытияФайла);
КонецПроцедуры
