

&НаКлиенте
Процедура Свойства(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор",СоздатьКлючСвойств());
	ОткрытьФорму("РегистрСведений.СвойстваСобытия.ФормаСписка", ПараметрыФормы, ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Функция СоздатьКлючСвойств()
	Результат = Новый Структура("Замер,Процесс,ПроцессID,ПериодФайла,ПериодСобытия,КлючСобытия");
	ЗаполнитьЗначенияСвойств(Результат, Запись);
	Возврат Результат;
КонецФункции