&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьСписокВыбораСостояний();
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	мНастройка = новый Структура();
	мНастройка.Вставить("ИсточникЗамер",ИсточникЗамер);
	мНастройка.Вставить("ИсточникСвойство",ИсточникСвойство);
	мНастройка.Вставить("МашинаСостояний",МашинаСостояний);
	МассивСтруктурСостояний = новый Массив;
	МассивСтруктурFSM = новый Массив;
	Для каждого стр из ТаблицаСостояний Цикл
		стр_н = новый Структура("Состояние");
		ЗаполнитьЗначенияСвойств(стр_н,стр);
		МассивСтруктурСостояний.Добавить(стр_н);
	КонецЦикла;
	Для каждого стр из ТаблицаFSM Цикл
		стр_н = новый Структура("ИсходноеСостояние,НовоеСостояние,Слово,ДельтаПереход,ДополнительнаяОбработка,УчетнаяЗапись,ШаблонСообщения");
		ЗаполнитьЗначенияСвойств(стр_н,стр);
		МассивСтруктурFSM.Добавить(стр_н);
	КонецЦикла;
	мНастройка.Вставить("МассивСтруктурСостояний",МассивСтруктурСостояний);
	мНастройка.Вставить("МассивСтруктурFSM",МассивСтруктурFSM);
	УправлениеХранилищемНастроекВызовСервера.ЗаписатьДанныеВБезопасноеХранилищеРасширенный(Замер,мНастройка,"Настройка замера с обработкой машиной состояний");
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройки(Команда)
	мНастройка = УправлениеХранилищемНастроекВызовСервера.ДанныеИзБезопасногоХранилища(Замер);
	Если мНастройка<>Неопределено Тогда
		ИсточникЗамер 		= мНастройка.ИсточникЗамер;
		ИсточникСвойство 	= мНастройка.ИсточникСвойство;
		МашинаСостояний 	= мНастройка.МашинаСостояний;
		ТаблицаСостояний.Очистить();
		Для каждого стр из мНастройка.МассивСтруктурСостояний Цикл
			стр_н = ТаблицаСостояний.Добавить();
			ЗаполнитьЗначенияСвойств(стр_н,стр);
		КонецЦикла;
		ОбновитьСписокВыбораСостояний();
		ТаблицаFSM.Очистить();
		Для каждого стр из мНастройка.МассивСтруктурFSM Цикл
			стр_н = ТаблицаFSM.Добавить();
			ЗаполнитьЗначенияСвойств(стр_н,стр);
		КонецЦикла;
	КонецЕсли;
	ОбновитьСписокВыбораСостояний();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСостоянийПриИзменении(Элемент)
	ОбновитьСписокВыбораСостояний();
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьСписокВыбораСостояний()
	
	Элементы.ТаблицаFSMИсходноеСостояние.СписокВыбора.Очистить();
	Элементы.ТаблицаFSMНовоеСостояние.СписокВыбора.Очистить();
	
	Для каждого стр из ТаблицаСостояний Цикл
		
		Элементы.ТаблицаFSMИсходноеСостояние.СписокВыбора.Добавить(стр.Состояние,стр.Состояние);
		Элементы.ТаблицаFSMНовоеСостояние.СписокВыбора.Добавить(стр.Состояние,стр.Состояние);
		
	КонецЦикла;
	
	Элементы.ТаблицаFSMИсходноеСостояние.СписокВыбора.Добавить("*","любое");
	Элементы.ТаблицаFSMНовоеСостояние.СписокВыбора.Добавить("*","любое");
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОбработкуНаСервере()
	мОбработка = РеквизитФормыВЗначение("Объект");
	мОбработка.ОбработатьДанныеМашинойСостояний(Замер);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбработку(Команда)
	ВыполнитьОбработкуНаСервере();
КонецПроцедуры
