&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЗначениеЗаполнено(РежимРаботы) Тогда
		РежимРаботы = "Простой";
	КонецЕсли;
	ИзменитьВидимостьЭлементовПоРежимуРаботы(РежимРаботы);
	ОбновитьСписокВыбораСостояний();
	
	Элементы.РежимРаботы.ТолькоПросмотр = Истина;
	
	Элементы.ТаблицаFSMИсходноеУсловие.СписокВыбора.Очистить();
	Элементы.ТаблицаFSMИсходноеУсловие.СписокВыбора.Добавить("=","равно");
	Элементы.ТаблицаFSMИсходноеУсловие.СписокВыбора.Добавить("<>","не равно");
	Элементы.ТаблицаFSMИсходноеУсловие.СписокВыбора.Добавить("в","в списке");
	Элементы.ТаблицаFSMИсходноеУсловие.СписокВыбора.Добавить("не в","не в списке");

	Элементы.ТаблицаFSMНовоеУсловие.СписокВыбора.Очистить();
	Элементы.ТаблицаFSMНовоеУсловие.СписокВыбора.Добавить("=","равно");
	Элементы.ТаблицаFSMНовоеУсловие.СписокВыбора.Добавить("<>","не равно");
	Элементы.ТаблицаFSMНовоеУсловие.СписокВыбора.Добавить("в","в списке");
	Элементы.ТаблицаFSMНовоеУсловие.СписокВыбора.Добавить("не в","не в списке");
	
КонецПроцедуры

&НаКлиенте
Процедура РежимРаботыПриИзменении(Элемент)
	ИзменитьВидимостьЭлементовПоРежимуРаботы(РежимРаботы);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВидимостьЭлементовПоРежимуРаботы(Режим)
	
	Если РежимРаботы="Простой" Тогда
		Элементы.ТаблицаFSMИсходноеУсловие.Видимость = Ложь;
		Элементы.ТаблицаFSMНовоеУсловие.Видимость = Ложь;
	ИначеЕсли РежимРаботы="Сложные условия" Тогда
		Элементы.ТаблицаFSMИсходноеУсловие.Видимость = Истина;
		Элементы.ТаблицаFSMНовоеУсловие.Видимость = Истина;
	КонецЕсли;
		 
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	мНастройка = новый Структура();
	мНастройка.Вставить("РежимРаботы",РежимРаботы);
	мНастройка.Вставить("ИсточникЗамер",ИсточникЗамер);
	мНастройка.Вставить("ИсточникСвойство",ИсточникСвойство);
	мНастройка.Вставить("МашинаСостояний",МашинаСостояний);
	МассивСтруктурСостояний = новый Массив;
	МассивСтруктурFSM = новый Массив;
	Для каждого стр из ТаблицаСостояний Цикл
		стр_н = новый Структура("Состояние");
		ЗаполнитьЗначенияСвойств(стр_н,стр);
		МассивСтруктурСостояний.Добавить(стр_н);
	КонецЦикла;
	Для каждого стр из ТаблицаFSM Цикл
		стр_н = новый Структура("ИсходноеСостояние,НовоеСостояние,Слово,ДельтаПереход,ДополнительнаяОбработка,УчетнаяЗапись,ШаблонСообщения");
		ЗаполнитьЗначенияСвойств(стр_н,стр);
		МассивСтруктурFSM.Добавить(стр_н);
	КонецЦикла;
	мНастройка.Вставить("МассивСтруктурСостояний",МассивСтруктурСостояний);
	мНастройка.Вставить("МассивСтруктурFSM",МассивСтруктурFSM);
	УправлениеХранилищемНастроекВызовСервера.ЗаписатьДанныеВБезопасноеХранилищеРасширенный(Замер,мНастройка,"Настройка замера с обработкой машиной состояний");
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройки(Команда)
	мНастройка = УправлениеХранилищемНастроекВызовСервера.ДанныеИзБезопасногоХранилища(Замер);
	Если мНастройка<>Неопределено Тогда
		ИсточникЗамер 		= мНастройка.ИсточникЗамер;
		ИсточникСвойство 	= мНастройка.ИсточникСвойство;
		МашинаСостояний 	= мНастройка.МашинаСостояний;
		ТаблицаСостояний.Очистить();
		Для каждого стр из мНастройка.МассивСтруктурСостояний Цикл
			стр_н = ТаблицаСостояний.Добавить();
			ЗаполнитьЗначенияСвойств(стр_н,стр);
		КонецЦикла;
		ОбновитьСписокВыбораСостояний();
		ТаблицаFSM.Очистить();
		Для каждого стр из мНастройка.МассивСтруктурFSM Цикл
			стр_н = ТаблицаFSM.Добавить();
			ЗаполнитьЗначенияСвойств(стр_н,стр);
		КонецЦикла;
	КонецЕсли;
	ОбновитьСписокВыбораСостояний();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСостоянийПриИзменении(Элемент)
	ОбновитьСписокВыбораСостояний();
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьСписокВыбораСостояний()
	
	Элементы.ТаблицаFSMИсходноеСостояние.СписокВыбора.Очистить();
	Элементы.ТаблицаFSMНовоеСостояние.СписокВыбора.Очистить();
	
	Для каждого стр из ТаблицаСостояний Цикл
		
		Элементы.ТаблицаFSMИсходноеСостояние.СписокВыбора.Добавить(стр.Состояние,стр.Состояние);
		Элементы.ТаблицаFSMНовоеСостояние.СписокВыбора.Добавить(стр.Состояние,стр.Состояние);
		
	КонецЦикла;
	
	Элементы.ТаблицаFSMИсходноеСостояние.СписокВыбора.Добавить("*","любое");
	Элементы.ТаблицаFSMНовоеСостояние.СписокВыбора.Добавить("*","любое");
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаFSMПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока=Истина Тогда
		ТекущиеДанные = Элемент.ТекущиеДанные;
		ТекущиеДанные.ИсходноеУсловие = "=";
		ТекущиеДанные.НовоеУсловие = "=";
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ВыполнитьОбработкуНаСервере()
	мОбработка = РеквизитФормыВЗначение("Объект");
	мОбработка.ОбработатьДанныеМашинойСостояний(Замер);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбработку(Команда)
	ВыполнитьОбработкуНаСервере();
КонецПроцедуры
