&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	мНастройка = новый Структура();
	мНастройка.Вставить("ИсточникЗамер",ИсточникЗамер);
	мНастройка.Вставить("ИсточникСвойство",ИсточникСвойство);
	мНастройка.Вставить("МашинаСостояний",МашинаСостояний);
	УправлениеХранилищемНастроекВызовСервера.ЗаписатьДанныеВБезопасноеХранилищеРасширенный(Замер,мНастройка,"Настройка замера с обработкой машиной состояний");
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройки(Команда)
	мНастройка = УправлениеХранилищемНастроекВызовСервера.ДанныеИзБезопасногоХранилища(Замер);
	Если мНастройка<>Неопределено Тогда
		ИсточникЗамер 		= мНастройка.ИсточникЗамер;
		ИсточникСвойство 	= мНастройка.ИсточникСвойство;
		МашинаСостояний 	= мНастройка.МашинаСостояний;
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ВыполнитьОбработкуНаСервере()
	мОбработка = РеквизитФормыВЗначение("Объект");
	мОбработка.ОбработатьДанныеМашинойСостояний(Замер);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбработку(Команда)
	ВыполнитьОбработкуНаСервере();
КонецПроцедуры
