


// Назначаемый отчет.
Функция ВидОбработкиОтчет() Экспорт
	
	Возврат "Отчет"; // не локализуется
	
КонецФункции

// Дополнительная обработка.
Функция ВидОбработкиДополнительнаяОбработка() Экспорт
	
	Возврат "ДополнительнаяОбработка"; // не локализуется
	
КонецФункции

// Дополнительный отчет.
Функция ВидОбработкиДополнительныйОтчет() Экспорт
	
	Возврат "ДополнительныйОтчет"; // не локализуется
	
КонецФункции

// Идентификатор, который используется для рабочего стола.
Функция ИдентификаторРабочегоСтола() Экспорт
	
	Возврат "РабочийСтол"; // не локализуется
	
КонецФункции

// Формирует наименование подсистемы в требуемом формате локализации.
//
// Параметры:
//   ДляПользователя - Булево - Код локализации.
//       Истина - Использовать основной язык текущего сеанса. Используется для вывода сообщений пользователю.
//       Ложь - Использовать основной язык конфигурации. Используется для записи сообщений в журнал регистрации.
//
// Возвращаемое значение:
//   Строка - Представление подсистемы.
//
Функция НаименованиеПодсистемы(ДляПользователя) Экспорт
	КодЯзыка = ?(ДляПользователя, ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка(), "");
	Возврат НСтр("ru = 'Дополнительные отчеты и обработки'", КодЯзыка);
КонецФункции
