
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		УчетнаяЗапись = "Бот Оракул";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	мНастройка = новый Структура();
	мНастройка.Вставить("IDПриложения",IDПриложения);
	мНастройка.Вставить("IDЧата",IDЧата);
	мНастройка.Вставить("Пароль",Пароль);
	УправлениеХранилищемНастроекВызовСервера.ЗаписатьДанныеВБезопасноеХранилищеРасширенный(УчетнаяЗапись,мНастройка,"Настройка отправки сообщений по Skype");
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройки(Команда)
	мНастройка = УправлениеХранилищемНастроекВызовСервера.ДанныеИзБезопасногоХранилища(УчетнаяЗапись);
	Если мНастройка<>Неопределено Тогда
		IDПриложения = мНастройка.IDПриложения;
		IDЧата = мНастройка.IDЧата;
		Пароль = мНастройка.Пароль;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщение(Команда)
	ОтправитьСообщениеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтправитьСообщениеНаСервере()
	
	мОъект = РеквизитФормыВЗначение("Объект");	
	Токен = мОъект.ПолучитьТокенSkype(IDПриложения, Пароль);
	мОъект.ОтправитьСообщениеSkype(Токен, IDЧата, ТекстСообщения);
	Сообщить("Успешно отправлено!");
КонецПроцедуры
