
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЗначениеЗаполнено(ШиринаОкна) Тогда
		ШиринаОкна = "День";
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(НачалоПериода1) Тогда
		НачалоПериода1 = НачалоДня(ТекущаяДата());
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(НачалоПериода2) Тогда
		НачалоПериода2 = НачалоДня(ТекущаяДата()-24*60*60);
	КонецЕсли;	
	СформироватьГрафикИсторияИзменений();
КонецПроцедуры

&НаСервере
Процедура СформироватьГрафикИсторияИзменений()
	
	Перем Выборка, КоличествоОшибок, КоличествоПровалов, КоличествоПропущенных, КоличествоТестовыхСлучаев, КоличествоУспешных, СерияОшибки, СерияПадения, СерияПропуски, СерияУспешно, Статусы, ТочкаДиаграммы;
	
	Диаграмма_ИсторияИзменений.Очистить();

	
	// настройки графика
	Если НЕ ЗначениеЗаполнено(ВидГрафика_ИсторияИзменений) Тогда
		ВидГрафика_ИсторияИзменений="Гистограмма";
	КонецЕсли;
	Элементы.ВидГрафика_ИсторияИзменений.РежимВыбораИзСписка = Истина;
	Элементы.ВидГрафика_ИсторияИзменений.РедактированиеТекста = Ложь;
	Элементы.ВидГрафика_ИсторияИзменений.СписокВыбора.Очистить();
	Элементы.ВидГрафика_ИсторияИзменений.СписокВыбора.Добавить("Гистограмма");
	Элементы.ВидГрафика_ИсторияИзменений.СписокВыбора.Добавить("График");
	Элементы.ВидГрафика_ИсторияИзменений.СписокВыбора.Добавить("ГистограммаОбъемная");
	Элементы.ВидГрафика_ИсторияИзменений.СписокВыбора.Добавить("ГрафикСОбластями");
	

	Диаграмма_ИсторияИзменений.ТипДиаграммы=ТипДиаграммы[ВидГрафика_ИсторияИзменений];
	
	СерияОкно1 = Диаграмма_ИсторияИзменений.УстановитьСерию("Период 1");
	СерияОкно2 = Диаграмма_ИсторияИзменений.УстановитьСерию("Период 2");
	
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СобытияЗамера.Ссылка) КАК ПовторенийСобытий,
	|	-РАЗНОСТЬДАТ(СобытияЗамера.ДатаСобытия, &Интервал1Начало, ЧАС) КАК КоличествоЧасовОтНачалаИнтервала
	|ПОМЕСТИТЬ ВтПовторенияИнтервал1
	|ИЗ
	|	Справочник.СобытияЗамера КАК СобытияЗамера
	|ГДЕ
	|	СобытияЗамера.Владелец = &Замер
	|	И СобытияЗамера.ДатаСобытия МЕЖДУ &Интервал1Начало И &Интервал1Окончание
	|
	|СГРУППИРОВАТЬ ПО
	|	-РАЗНОСТЬДАТ(СобытияЗамера.ДатаСобытия, &Интервал1Начало, ЧАС)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СобытияЗамера.Ссылка) КАК ПовторенийСобытий,
	|	-РАЗНОСТЬДАТ(СобытияЗамера.ДатаСобытия, &Интервал2Начало, ЧАС) КАК КоличествоЧасовОтНачалаИнтервала
	|ПОМЕСТИТЬ ВтПовторенияИнтервал2
	|ИЗ
	|	Справочник.СобытияЗамера КАК СобытияЗамера
	|ГДЕ
	|	СобытияЗамера.Владелец = &Замер
	|	И СобытияЗамера.ДатаСобытия МЕЖДУ &Интервал2Начало И &Интервал2Окончание
	|
	|СГРУППИРОВАТЬ ПО
	|	-РАЗНОСТЬДАТ(СобытияЗамера.ДатаСобытия, &Интервал2Начало, ЧАС)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВтПовторенияИнтервал1.КоличествоЧасовОтНачалаИнтервала, ВтПовторенияИнтервал2.КоличествоЧасовОтНачалаИнтервала) КАК КоличествоЧасовОтНачалаИнтервала,
	|	ЕСТЬNULL(ВтПовторенияИнтервал1.ПовторенийСобытий, 0) КАК ПовторенийСобытий1,
	|	ЕСТЬNULL(ВтПовторенияИнтервал2.ПовторенийСобытий, 0) КАК ПовторенийСобытий2
	|ИЗ
	|	ВтПовторенияИнтервал1 КАК ВтПовторенияИнтервал1
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВтПовторенияИнтервал2 КАК ВтПовторенияИнтервал2
	|		ПО ВтПовторенияИнтервал1.КоличествоЧасовОтНачалаИнтервала = ВтПовторенияИнтервал2.КоличествоЧасовОтНачалаИнтервала
	|
	|УПОРЯДОЧИТЬ ПО
	|	КоличествоЧасовОтНачалаИнтервала";
	
	ШиринаОкнаСекунды = 24*60*60;
	
	Запрос.УстановитьПараметр("Замер",Замер);
	Запрос.УстановитьПараметр("Интервал1Начало",НачалоПериода1);
	Запрос.УстановитьПараметр("Интервал1Окончание",НачалоПериода1+ШиринаОкнаСекунды);
	Запрос.УстановитьПараметр("Интервал2Начало",НачалоПериода2);
	Запрос.УстановитьПараметр("Интервал2Окончание",НачалоПериода2+ШиринаОкнаСекунды);
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	

	Пока Выборка.Следующий() Цикл
		
		ТочкаДиаграммы = Диаграмма_ИсторияИзменений.УстановитьТочку(Выборка.КоличествоЧасовОтНачалаИнтервала);
		
		СерияОкно1.Цвет = новый Цвет(155,50,50);
		СерияОкно2.Цвет = новый Цвет(255,165,15); 		
		
		Диаграмма_ИсторияИзменений.УстановитьЗначение(ТочкаДиаграммы,СерияОкно1, Выборка.ПовторенийСобытий1);
		Диаграмма_ИсторияИзменений.УстановитьЗначение(ТочкаДиаграммы,СерияОкно2, Выборка.ПовторенийСобытий2);
		
		
	КонецЦикла;
	
	
	Диаграмма_ИсторияИзменений.ВидПодписей=ВидПодписейКДиаграмме.Значение;

КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	СформироватьГрафикИсторияИзменений();
КонецПроцедуры

&НаКлиенте
Процедура Вперед(Команда)
	ШиринаОкнаСекунды = 24*60*60;
	НачалоПериода1 = НачалоПериода1 + ШиринаОкнаСекунды;
	НачалоПериода2 = НачалоПериода2 + ШиринаОкнаСекунды;
	СформироватьГрафикИсторияИзменений();
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	ШиринаОкнаСекунды = 24*60*60;
	НачалоПериода1 = НачалоПериода1 - ШиринаОкнаСекунды;
	НачалоПериода2 = НачалоПериода2 - ШиринаОкнаСекунды;
	СформироватьГрафикИсторияИзменений();
КонецПроцедуры

&НаКлиенте
Процедура ВидГрафика_ИсторияИзмененийПриИзменении(Элемент)
	СформироватьГрафикИсторияИзменений();
КонецПроцедуры

&НаКлиенте
Процедура ЗамерПриИзменении(Элемент)
	СформироватьГрафикИсторияИзменений();
КонецПроцедуры
