
&НаСервереБезКонтекста
Процедура ОчиститьЖурналНаСервере()
	НаборЗаписей = РегистрыСведений.Журнал.СоздатьНаборЗаписей();
	НаборЗаписей.Записать(Истина);
	НаборЗаписей = РегистрыСведений.ГраницыЧтенияДанных.СоздатьНаборЗаписей();
	НаборЗаписей.Записать(Истина);
	НаборЗаписей = РегистрыСведений.СвойстваСобытия.СоздатьНаборЗаписей();
	НаборЗаписей.Записать(Истина);
	НаборЗаписей = РегистрыСведений.СтатусЗагрузки.СоздатьНаборЗаписей();
	НаборЗаписей.Записать(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьЖурнал(Команда)
	ОчиститьЖурналНаСервере();
КонецПроцедуры