Процедура ЗаписатьСобытие(СтруктураЗаписи) Экспорт
	//запись выполняется одновременно для события журнала и свойств - событие менеджером записи, свойства набором
	//см. ОбновлениеДанных.ПолучитьСтруктуруЗаписиЖурнала()
	
	НачатьТранзакцию();
	
	МенеджерЗаписи = РегистрыСведений.Журнал.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтруктураЗаписи, "Замер,Процесс,ПроцессID,ПериодФайла,ПериодСобытия,ДоляПериода,Событие,КлючСобытия,Длительность,Уровень,ЗначениеСвойств");
	МенеджерЗаписи.Записать();

	КлючевыеПоля = "Замер,Процесс,ПроцессID,ПериодФайла,ПериодСобытия,КлючСобытия";
	КлючевыеПоляМассив = СтрРазделить(КлючевыеПоля, ",");
	НаборЗаписейСвойства = РегистрыСведений.СвойстваСобытия.СоздатьНаборЗаписей();
	Для Каждого ИмяИзмерения Из КлючевыеПоляМассив Цикл
		НаборЗаписейСвойства.Отбор[ИмяИзмерения].Установить(СтруктураЗаписи[ИмяИзмерения]);
	КонецЦикла;
	Для Каждого СтрокаСвойства Из СтруктураЗаписи.Свойства Цикл
		ЗаписьСвойства = НаборЗаписейСвойства.Добавить();
		ЗаполнитьЗначенияСвойств(ЗаписьСвойства, СтруктураЗаписи, КлючевыеПоля);
		ЗаписьСвойства.Свойство = СтрокаСвойства.Ключ;
		ЗаписьСвойства.ЗначениеСвойства = СтрокаСвойства.Значение; 
	КонецЦикла;
	НаборЗаписейСвойства.Записать();
	
	ЗафиксироватьТранзакцию();

КонецПроцедуры