
&НаКлиенте
Процедура КлючевыеСвойстваВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекСвойство = Элементы.КлючевыеСвойства.ТекущиеДанные.Свойство;
	ТекСтрока = Элементы.КлючевыеСвойства.ТекущиеДанные.Значение;	
	Если МногострочныеСвойства.Получить(ТекСвойство)=Неопределено Тогда 
		ПоказатьВводСтроки(Новый ОписаниеОповещения("ВводСтрокиЗавершение", ЭтотОбъект), ТекСтрока, Строка(ТекСвойство))
	Иначе
		Т = Новый ТекстовыйДокумент();
		Т.ДобавитьСтроку(ТекСтрока);
		Т.Показать(Строка(ТекСвойство));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВводСтрокиЗавершение(Результат, Параметры) Экспорт
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МногострочныеСвойства = СправочникиСерверПовтИсп.МногострочныеСвойства();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВсеСвойства(Команда)
	Т = Новый ТекстовыйДокумент();
	Т.ДобавитьСтроку(Объект.ВсеСвойства);
	Т.Показать("Все свойства");
КонецПроцедуры






