&НаКлиенте 
Перем КэшРеквизитыСвойства;

&НаКлиенте
Процедура КлючевыеСвойстваВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекСвойство = Элементы.КлючевыеСвойства.ТекущиеДанные.Свойство;
	ТекСтрока = Элементы.КлючевыеСвойства.ТекущиеДанные.Значение;	
	Если ИспользуетсяМногострочныйРежим(ТекСвойство) Тогда 
		Т = Новый ТекстовыйДокумент();
		Т.ДобавитьСтроку(ТекСтрока);
		Т.Показать(Строка(ТекСвойство));
	Иначе
		ПоказатьВводСтроки(Новый ОписаниеОповещения("ВводСтрокиЗавершение", ЭтотОбъект), ТекСтрока, Строка(ТекСвойство))
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ИспользуетсяМногострочныйРежим(Свойство)
	МногострочныйРежим = КэшРеквизитыСвойства.Получить(Свойство);
	Если МногострочныйРежим=Неопределено Тогда
		МногострочныйРежим = РеквизитыСвойстваСервер(Свойство).МногострочныйРежим;
		КэшРеквизитыСвойства.Вставить(Свойство, МногострочныйРежим);
	КонецЕсли;
	Возврат МногострочныйРежим;
КонецФункции

&НаСервереБезКонтекста
Функция РеквизитыСвойстваСервер(Свойство)
	Возврат СправочникиСерверПовтИсп.РеквизитыСвойства(Свойство);
КонецФункции

&НаКлиенте
Процедура ВводСтрокиЗавершение(Результат, Параметры) Экспорт
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВсеСвойства(Команда)
	Т = Новый ТекстовыйДокумент();
	Т.ДобавитьСтроку(Объект.ВсеСвойства);
	Т.Показать("Все свойства");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	КэшРеквизитыСвойства = Новый Соответствие;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОписаниеСитуации(Команда)
	Если Элементы.КлючевыеСвойства.ТекущаяСтрока<>Неопределено Тогда
		ТД = Объект.КлючевыеСвойства.НайтиПоИдентификатору(Элементы.КлючевыеСвойства.ТекущаяСтрока);
		Если ЗначениеЗаполнено(ТД.ХешЗначения) Тогда
			ЗначенияЗаполнения = Новый Структура("Свойство,Значение,ХешЗначения");
			ЗаполнитьЗначенияСвойств(ЗначенияЗаполнения, ТД);
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
			ОткрытьФорму("Справочник.ИзвестныеСитуации.ФормаОбъекта", ПараметрыФормы, ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Иначе
			Состояние(СтрШаблон("Для свойства %1 отключено создание хеша", ТД.Свойство));
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры



