
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЗначениеЗаполнено(ИсточникЗагрузки) Тогда
		ИсточникЗагрузки = "github";
	КонецЕсли;
	ИзменитьСтраницуЗагрузки();
КонецПроцедуры

&НаКлиенте
Процедура ИсточникЗагрузкиПриИзменении(Элемент)
	ИзменитьСтраницуЗагрузки();
КонецПроцедуры


&Наклиенте
Процедура  ИзменитьСтраницуЗагрузки()
	Если ИсточникЗагрузки="github" Тогда
		HTML="https://github.com/Polyplastic/1c-parsing-tech-log";
	ИначеЕсли ИсточникЗагрузки="infostart" Тогда
		HTML="https://infostart.ru/public/936096/";
	ИначеЕсли ИсточникЗагрузки="testingtool" Тогда
		HTML="https://testingtool.ru/frejmvork-monitoring-proizvoditelnosti/";
	КонецЕсли;
КонецПроцедуры