
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	мНастройка = новый Структура();
	мНастройка.Вставить("НечеткийКонтроллер",НечеткийКонтроллер);
	мНастройка.Вставить("СохранятьЗначенияПреобразованияСигналов",СохранятьЗначенияПреобразованияСигналов);
	МассивСтруктур = новый Массив;
	Для каждого стр из ТаблицаСвязейВходовДанных Цикл
		Структура = новый Структура("Замер,Свойство,НомерВхода");
		ЗаполнитьЗначенияСвойств(Структура,стр);
		МассивСтруктур.Добавить(Структура);
	КонецЦикла;
	мНастройка.Вставить("МассивСтруктурСвязейВходовДанных",МассивСтруктур);
	УправлениеХранилищемНастроекВызовСервера.ЗаписатьДанныеВБезопасноеХранилищеРасширенный(Замер,мНастройка,"Настройка нейронной сети для обработки данных по замеру");
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройки(Команда)
	мНастройка = УправлениеХранилищемНастроекВызовСервера.ДанныеИзБезопасногоХранилища(Замер);
	Если мНастройка<>Неопределено Тогда
		НечеткийКонтроллер = мНастройка.НечеткийКонтроллер;
		СохранятьЗначенияПреобразованияСигналов = мНастройка.СохранятьЗначенияПреобразованияСигналов;
		ТаблицаСвязейВходовДанных.Очистить();
		Для каждого стр из мНастройка.МассивСтруктурСвязейВходовДанных Цикл
			стр_н = ТаблицаСвязейВходовДанных.Добавить();
			ЗаполнитьЗначенияСвойств(стр_н,стр);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОбработкуНаСервере()
	мОбъект = РеквизитФормыВЗначение("Объект");
	мОбъект.ОбработатьДанныеНечеткимКонтроллером(Замер);
КонецПроцедуры


&НаКлиенте
Процедура ВыполнитьОбработку(Команда)
	ВыполнитьОбработкуНаСервере();
КонецПроцедуры

//TODO: Загружать количество входов при изменении модели