

&НаКлиенте
Процедура Команда1(Команда)
	Команда1НаСервере();
	ПоказатьПредупреждение(,"Все");
КонецПроцедуры

&НаСервереБезКонтекста
Процедура Команда1НаСервере()
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Процессы.Ссылка,
		|	Процессы.Наименование
		|ИЗ
		|	Справочник.Процессы КАК Процессы
		|ГДЕ
		|	Процессы.Код = """"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	События.Ссылка,
		|	События.Наименование
		|ИЗ
		|	Справочник.События КАК События
		|ГДЕ
		|	События.Код = """"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Свойства.Ссылка,
		|	Свойства.Наименование
		|ИЗ
		|	Справочник.Свойства КАК Свойства
		|ГДЕ
		|	Свойства.Код = """"";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		спроб = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		спроб.Код = ВыборкаДетальныеЗаписи.Наименование;
		спроб.Записать();
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
КонецПроцедуры
