#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ЗаписатьСобытие(СтруктураЗаписи) Экспорт
	СобытиеОбъект = Справочники.СобытияЗамера.СоздатьЭлемент();
	//реквизиты
	ЗаполнитьЗначенияСвойств(СобытиеОбъект, СтруктураЗаписи, "Владелец, ТипПроцесса, Файл, НомерСтрокиФайла, ДатаСобытия, ДатаСобытияМкс, ДлительностьМкс, ТипСобытия, УровеньСобытия, ВсеСвойства, Ключ");
	//тч
	Для Каждого элемент из СтруктураЗаписи.КлючевыеСвойства Цикл
		строкасвойства = СобытиеОбъект.КлючевыеСвойства.Добавить();
		строкасвойства.Свойство = элемент.Ключ;
		строкасвойства.Значение = элемент.Значение;
	КонецЦикла;
	СобытиеОбъект.Записать();
	Возврат СобытиеОбъект.Ссылка;
КонецФункции

Функция ЗаписатьСобытиеЧисло(СтруктураЗаписи) Экспорт
	СобытиеОбъект = Справочники.СобытияЗамера.СоздатьЭлемент();
	//реквизиты
	ЗаполнитьЗначенияСвойств(СобытиеОбъект, СтруктураЗаписи, "Владелец, ТипПроцесса, Файл, НомерСтрокиФайла, ДатаСобытия, ДатаСобытияМкс, ДлительностьМкс, ТипСобытия, УровеньСобытия, ВсеСвойства, Ключ");
	//тч
	Для Каждого элемент из СтруктураЗаписи.КлючевыеСвойства Цикл
		строкасвойства = СобытиеОбъект.КлючевыеСвойства.Добавить();
		строкасвойства.Свойство = элемент.Ключ;
		строкасвойства.Значение = элемент.Значение;
		строкасвойства.ЗначениеЧисло = элемент.Значение;
	КонецЦикла;
	СобытиеОбъект.Записать();
	Возврат СобытиеОбъект.Ссылка;
КонецФункции

#КонецЕсли