
&НаСервере
Процедура УдалитьПрограммноНаСервере()
	Если НЕ ЗначениеЗаполнено(Замер) Тогда
		Сообщить("Укажите замер!");
		Возврат;
	КонецЕсли;
	
	Запрос = новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	СобытияЗамера.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СобытияЗамера КАК СобытияЗамера
	|ГДЕ
	|	СобытияЗамера.Владелец = &Замер
	|	И СобытияЗамера.ДатаСобытия МЕЖДУ &ДатаНачала И &ДатаОкончания";
	Запрос.УстановитьПараметр("Замер",Замер);
	Запрос.УстановитьПараметр("ДатаНачала",Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",Период.ДатаОкончания);
	
	Выборка = Запрос.Выполнить().Выбрать();
	КоличествоУдаленных = 0;
	
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Попытка
			ДокОбъект.Удалить();
			КоличествоУдаленных = КоличествоУдаленных+1;
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
	
	Сообщить("Удалено :"+КоличествоУдаленных);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПрограммно(Команда)
	УдалитьПрограммноНаСервере();
КонецПроцедуры
